["RT @CounsellingKaz: when something upsetting happens, or you wake up in a low mood this perfectionism can come into play, as \"jerk brain\" i…", "@kykaree After being a cub, scout and police cadet I volunteered at the local beavers which was so much fun. I pulled out when I became unwell and convinced others might find out about my childhood and assume I was only volunteering because I was a perp... even now I worry (cont) #csaqt", "RT @myworldmywords: @7107Lilly @StrongWalkAlone @green_pagan @kykaree @CSAQT I agree with Kira, maybe if you found the right environment to…", "@lilgrace2911 Dont be sorry for looking after your self\nTake care #csaqt", "RT @shinybluedress: @CuriousQualia @CSAQT @StevenJPayton Your placemats are lovely CQ - I can recommend them #CSAQT https://t.co/gmr5w1B3hi", "@kykaree They’re awesome Kylie #csaqt", "RT @green_pagan: @lilgrace2911 And if it goes wrong wtf if I'm going to be fkd up I may as well go the whole hog #csaqt turns out we have a…", "@CestriaTherapy Good evening Deborah #CSAQT", "@green_pagan @StevenJPayton hey, so long as you content note, and feel comfortable sharing #CSAQT", "@CSAQT @7107Lilly @green_pagan @kykaree I did some mosaic recently but to me it’s always rubbish #CSAQT", "@kykaree So how would cognitive mindfulness work?\nIm not sure I have come across that\n#csaqt", "@StrongWalkAlone I think it's just a nasty rumour, it doesn't exist #csaqt", "RT @Frenchhen74: Good evening all #CSAQT", "@CSAQT Yes heavy metal #CSAQT", "Hello Kirsty- it’s Sue here x #CSAQT https://t.co/W8uHzUFfzx", "@CuriousQualia @CSAQT @StevenJPayton Your placemats are lovely CQ - I can recommend them #CSAQT https://t.co/gmr5w1B3hi", "This weeks twitterchat for CSA and CSE survivors &amp; supporters is focused around hobbies\n\nBecause we are MUCH more than what happened to us.\n\nJoin the conversation\nApril 16th 8-9pm UK🇬🇧\nat the hashtag #CSAQT https://t.co/dU9vKvQxkf", "RT @cmwolfy12: I’m knee deep studying finding it very stressful so no time for hobbies. Makes me sad for myself but I know the end is near…", "RT @johnharvey1976: Good night and hope everyone will have a trigger-free night sleep. Remember that we all are wonderful, amazing, and bea…", "I’m Sue @shinybluedress by the way. Lol #csaqt https://t.co/kR4s0gCw2U", "RT @CounsellingKaz: @johnharvey1976 wonderful advice! #CSAQT", "RT @StevenJPayton: @kykaree :) we are blessed :)\nwelcome to chat #csaqt", "RT @green_pagan: @StrongWalkAlone @7107Lilly @kykaree @CSAQT I'm sorry that happened to you. She was wrong #CSAQT", "RT @myworldmywords: @CestriaTherapy @CounsellingKaz Whether watching from a safe distance or actively participating you are a part of the #…", "How about setting up a blog John? Wordpress is a useful site to use - you can easily set up an account #CSAQT https://t.co/gr2ePBRLzy", "@myworldmywords @kykaree so much damage is done by ignorance and prejudice #csaqt", "@kykaree I didn’t know we had a summer! When’s that? #csaqt", "@StevenJPayton @shinybluedress Great cycling around here #csaqt #Annecy", "RT @Frenchhen74: @CounsellingKaz It makes me feel so useless, and that even when I try, I just can’t get it right. I always try to be a nic…", "@myworldmywords I'm sure scouting would welcome you. I've disclosed to my group section leader and assistant district commissioner who are beyond supportive #csaqt", "@carynwalker4 Hi Caryn\nWelcome to #csaqt chat", "RT @myworldmywords: @kykaree @Luciek11K @Frenchhen74 @CounsellingKaz I find reading difficult at best of times, I guess in part from never…", "@myworldmywords @CSAQT @kykaree @Luciek11K @Frenchhen74 @CounsellingKaz Yes could be good. Some people aren't visual so something auditory would be good #CSAQT", "I’m really not doing well right now. Im sorry. I gotta go. Today is just too much. #CSAQT", "@CounsellingKaz It gets me really down if I disappoint someone or het criticism about something I’ve done. I just feel awful about it. But I don’t think I’m a perfectionist in any way. #csaqt", "As you may have guessed one of my hobbies is photography #CSAQT https://t.co/lYpopvjkKU", "RT @Frenchhen74: @lilgrace2911 @green_pagan Maybe you have to believe in yourself. But I don’t have the instruction book for that, 😐 sorry.…", "Look! I'm on time!!! #csaqt", "I think mine are all things that people who abused me said I couldn’t or shouldn’t do. They are stereotypical male things. Camping, kayaking, hiking, working out, fishing, splitting wood. But I like them just the same and they are very therapeutic. #CSAQT", "I can be really good at dodging things or people that will upset me.  I am not sure if it is in my head but it seems I can spot a crude person in two seconds after seeing them. I tend to see them a lot more since I am grown than I did as a kid.  #csaqt", "RT @lilgrace2911: I can’t do this tonight. Sorry. I just can’t. #CSAQT", "This must be very relaxing to do, John. #CSAQT https://t.co/GkdU3vt69b", "RT @green_pagan: @Frenchhen74 @CounsellingKaz Or to give praise for that matter. Another concsious decision for me. Goes against my grain t…", "RT @green_pagan: @Frenchhen74 @CounsellingKaz I probably go over the top with it now in an attempt to over compensate that #csaqt", "RT @Frenchhen74: @StevenJPayton Hi Steven, how are you doing? #csaqt", "@Frenchhen74 @StevenJPayton Would love to go there one day Hen #CSAQT", "@CounsellingKaz @Frenchhen74 @StevenJPayton I just don’t feel it’s fair. People come here for support and I never seem to be able to support anyone. I just take. That’s just not fair. #CSAQT", "Good night and hope everyone will have a trigger-free night sleep. Remember that we all are wonderful, amazing, and beautiful. #csaqt", "@StevenJPayton I have lots of interests/hobbies. I do a lot of knot tying &amp; ropework. Knots are like 3D puzzles they can be totally absorbing, leaving little room for intrusions #csaqt", "@StevenJPayton @CounsellingKaz How to make someone feel their contributions are not welcome #csaqt", "@myworldmywords @7107Lilly @green_pagan @kykaree @CSAQT @KyraWomen I enjoy my poetry but don’t really see that as art. #csaqt", "RT @CSAQT: Welcome everyone to our twitterchat hour at #CSAQT\nI’m Sue Crocombe, retweeting from this account until 9pm", "RT @CounsellingKaz: So part of being able to bounce back is accepting that perfection isnt possible, and thats OK, days do not have to be a…", "Join in tonight at #CSAQT https://t.co/BdFbgfBpBa", "@lilgrace2911 look after your self Lucy\n#csaqt", "RT @kykaree: At the moment knitting is a favourite hobby of mine  #csaqt", "RT @CounsellingKaz: A bad minute doesn't need to lead to a bad day #Truth! #CSAQT https://t.co/VP6Zu3x8BH", "@johnharvey1976 Hi John\nWelcome to chat\n#csaqt", "@cmwolfy12 it can be hard to learn to take constructive criticism as its intended #CSAQT", "@Frenchhen74 I love cross stitch and embroidery but it hurts my wrist #csaqt", "RT @cmwolfy12: @CounsellingKaz Yeah I’ve been trying. Asking for help etc but still I feel inadequate. I know it will pass and get easier o…", "RT @Luciek11K: @myworldmywords @CSAQT @CounsellingKaz Quieter outdoor pursuits are nice..we get so much about the importance of exercise bu…", "@StevenJPayton It’s actually more that I don’t feel it’s fair to inflict my negativity on a positive chat. #csaqt", "RT @kykaree: @StevenJPayton @CounsellingKaz How to make someone feel their contributions are not welcome #csaqt", "Good evening everyone hobbies can be so important, there can be a belief that we \"should\" be working on our past at every moment, which apart from being impossible isnt healthy #CSAQT", "@shinybluedress Mine too Sue, and for the same reasons :)  #CSAQT", "@kykaree I enjoy knitting too... very absorbing #csaqt (Sue)", "@johnharvey1976 Hi John Harvey! I really enjoy writing also, both as a means of self-expression but also fictional stories, just to use my imagination. #csaqt", "@johnharvey1976 I like having the radio on. #csaqt", "@CounsellingKaz Reading was always huge for me but concentration not always up to it now. Art and my pets...they are a beautiful way to be occupied #CSAQT", "@StevenJPayton Mindfulness CBT is the best thing to Google. It means to use conscious awareness to help get perspective so e.g. If I'm starting to get into panic I 'check in' what's happening for me right now, what do I need to do to prevent over breathing, how can I feel safe? #csaqt", "RT @Frenchhen74: @johnharvey1976 I like having the radio on. #csaqt", "RT @shinybluedress: My hobbies are walking &amp; cycling... which I find very therapeutic - a way to fight off that big black dog\n❤️Dorset\n#CSA…", "@green_pagan @CounsellingKaz I find it hard to praise my children. I feel so bad about that. #csaqt", "RT @CounsellingKaz: https://t.co/PoGNmHQqcL a post on self care and rewarding ourselves #CSAQT", "RT @CounsellingKaz: @Luciek11K reading can just be wonderful, its part of my bedtime wind down routine too #CSAQT", "To everybody, those that feel able to join in the chat and those fellow travelers watching, welcome to #CSAQT tonight, Hail &amp; well met", "RT @StevenJPayton: @Frenchhen74 I am managing today thank you\n#csaqt", "RT @CounsellingKaz: @kykaree can you share anything thats worked for you kylie #CSAQT", "RT @cmwolfy12: I’m in awe of all your hobbies and crafts I can’t wait to get some free time and do stuff. Some great ideas here  #CSAQT", "@bramhallbridge He's 8 now, still very clever and very kind I'm very blessed. #csaqt", "RT @cmwolfy12: I’m having too many bad days at the mo due to stress and being overwhelmed need to lessen the load but can’t see how #CSAQT", "@StevenJPayton It’s amazing #csaqt", "@MJCounselling beautiful! #CSAQT", "things that could go on a self care list \nhttps://t.co/5rZca7mfiI shows that you enjoy\n2. favourite books\n3. Moisturing or other skin care routines\n4.Crafting\n5. Colouring books\n\nself care doesnt need to be expensive or complex, iwhen you are struggling simple works best #CSAQT", "RT @Frenchhen74: @CounsellingKaz Probably am. But I keep trying not to be. #csaqt", "Today TwitterChats\n#OZ Time/AEST\n5AM #EngChatUK #ContentChat #CommsChat #WealChat #CSAQT", "@myworldmywords 😂😂😂😂 I love snakes 🐍 I'm seriously scared of emus #csaqt", "RT @green_pagan: @Frenchhen74 @lilgrace2911 It gets harder before it gets better. To quote @shinybluedress its like picking a scab and sque…", "Great to see you Al #CSAQT https://t.co/uAAP0xsWlD", "@StevenJPayton I think I have two views on this. One before I got to a good place with myself and one after. When I was in the midst of searching for answers, pulling myself out would have been a lot harder. Now I'm more #resilient. #CSAQT", "I would love to learn how to make some mead and had it once many years ago but never stop loving how it tastes. #csaqt", "RT @CounsellingKaz: @johnharvey1976 it sounds like you have learned to trust your gut, which is fab #CSAQT", "@CuriousQualia What sort of hobbies and how do they distract you?\n#csaqt", "@Frenchhen74 @johnharvey1976 when I had post natal depression the radio was a lifesaver #CSAQT", "@SAWhitacre @DavidLeanLeano @ChrisTuck_WWHF @sarah_wigington @RachelintheOC @jcstaff_ @DrAndyMayers @CestriaTherapy @Frenchhen74 @HayleyMcGregor1 @Sunnyclaribel Look forward to seeing you at #CSAQT", "@CounsellingKaz Firstly checking in 'I'm breathing quicker, I'm feeling hot, I have tightness' then 'what's causing this?' Smell, crowds, a memory, a song then 'what can I do right now in this moment to feel better' leave the situation, listen to music, have a drink of water? #csaqt", "I bounce back with music and is the best medicine for me on a bad day.#csaqt", "@CounsellingKaz I'd love to set up some fishing for therapy group, what better place to learn mindfulness than on a lakeside, plus learning the skills and discipline of care for  fish and nature, beats a stuffy claustrophobic room #csaqt", "RT @CounsellingKaz: @StevenJPayton I think it starts from accepting its ok to have bad days, its not a failure #CSAQT", "I’d like to learn badminton #csaqt https://t.co/VH8jKOggW9", "RT @CounsellingKaz: @Frenchhen74 as if if you cant be perfect you must be terrible? #CSAQT", "RT @green_pagan: @CounsellingKaz @StevenJPayton Everyone has them #csaqt", "RT @green_pagan: @Eloc42617770 @CSAQT @btcc_crazy He's much better than me I just like to burn wood in the polite sense of the word #CSAQT", "Very important. Sometimes I make myself too busy so that I don’t have to think. But then I get burnt out and overtired and feel less able to cope. Rest us so important #csaqt https://t.co/jW01n18PMb", "@lilgrace2911 @kykaree books are an incredible way to escape #CSAQT", "RT @StevenJPayton: Tonights #CSAQT brought to U by the letter H, Hobbies\n\nDo your hobbies help you cope when times get rough?\nHow do your h…", "@CSAQT @PookyH often tweets 3 good things. Asks us to think of  3 good things that have happeed that day:)\n#csaqt", "RT @CounsellingKaz: @Frenchhen74 why do you think criticism hurts so much Hen #CSAQT", "@carynwalker4 Hey! Welcome to our chat! I’m dipping between this account and @CSAQT until 9pm but follow the comments under the hashtag #csaqt", "@cmwolfy12 @green_pagan @CounsellingKaz You’ll get your degree because you deserve it! #csaqt", "RT @StevenJPayton: @kykaree Can you expand a bit on Non meditation Mindfulness?\n#csaqt", "RT @green_pagan: @CSAQT Im up for that @CSAQT although may need reminding I have a head like a seive #CSAQT", "@CSAQT Good evening all, running late this evening.... over excited puppy, &amp; son not much better! #csaqt", "#CSAQT ok have to put it out there how hard it is to have hobbies when your dad used to break your things during boozy headfucks. Kinda puts you off so it's been something I've had to push myself into", "RT @myworldmywords: And I get to meet these beautiful creatures\n#csaqt https://t.co/bHAYlHPiMD", "RT @johnharvey1976: A walk in the park and especially after it rain can be so soothing. Listening to the sound of nature on a cd can also b…", "RT @StevenJPayton: @Eloc42617770 Had a lot of help. It was a course run by an archeologist\n#csaqt", "@StevenJPayton Doing my best but it’s really not easy. #CSAQT", "RT @green_pagan: @CSAQT Burning art onto wood #CSAQT", "RT @StevenJPayton: @green_pagan Hi Kirsty\nwelcome to tonight chat\n#csaqt", "RT @7107Lilly: @CSAQT Hello everyone! So glad to have made it! 🐱 #csaqt", "@CestriaTherapy @CounsellingKaz You are most welcome, spectating or tweeting :)\n#csaqt", "I can’t do this tonight. Sorry. I just can’t. #CSAQT", "@StrongWalkAlone @green_pagan @kykaree @CSAQT Oh, I am so sorry that you're beautiful childhood art efforts were rejected. Parents are supposed to celebrate and praise their children's creations. Some parents are damaged themselves and so cannot give that support. I hope someday you will allow yourself to try again. #csaqt", "@kykaree hanks for such an honest admission #CSAQT", "Welcome Kylie :)\n#csaqt https://t.co/cPPlrqTYgU", "I also joined Brownies which helped and now I'm a Beaver scout leader  #CSAQT", "@CSAQT Yes they're mine, made from plastic beads. #csaqt", "@CounsellingKaz Most of my panic attacks were caused by frightened little Kylie thinking she was in a vulnerable situation so behaving like a mum to her helped. I never had that when I was little #csaqt", "RT @kykaree: @CounsellingKaz I have a wellness recovery action plan that really works for me there are some great templates on the internet…", "RT @green_pagan: #csaqt thankyou as always guys. Take great care of yourselves", "RT @kykaree: @CounsellingKaz Most of my panic attacks were caused by frightened little Kylie thinking she was in a vulnerable situation so…", "@green_pagan @lilgrace2911 I find that the further I go, &amp; the more consious I become of my ways of reacting, &amp; how they are directly related to the abuse, the harder it gets. #csaqt", "@green_pagan Hi Kirsty\nwelcome to tonight chat\n#csaqt", "RT @CounsellingKaz: @cmwolfy12 a wonderful final thought #CSAQT", "@cmwolfy12 Hi wolfie #csaqt", "@lilgrace2911 I have found over the past year allowing myself to do things that have the potential to hurt me has been liberating and has changed my life #csaqt", "Can we take some of what our hobbies give us out into the wider world?\n#csaqt", "RT @StevenJPayton: @green_pagan @Frenchhen74 @CounsellingKaz Sometimes there is the feeling that \"everything has gone to **** so i might as…", "@johnharvey1976 @StrongWalkAlone @green_pagan @kykaree @CSAQT I so agree John Harvey. Very well said. #csaqt", "@LostAlice77 @StevenJPayton I find it very calming to do research. Hope you're getting along well on your genealogy research. I 've only just started mine. #csaqt", "@johnharvey1976 Hi John welcome to tonights chat\n#csaqt", "@StevenJPayton Sounds good but I do not want to be a survivor I'm a \"thriver\" #CSAQT", "@cmwolfy12 hi wolfie! #CSAQT", "@myworldmywords @CounsellingKaz I think this sort of mindfulness is really important for survivors as it's much safer than mindfulness meditation. #CSAQT", "@kykaree Reading helped me get through the worst times. Gave me an escape. #csaqt", "RT @CuriousQualia: @StevenJPayton I have lots of interests/hobbies. I do a lot of knot tying &amp; ropework. Knots are like 3D puzzles they can…", "RT @lilgrace2911: @green_pagan But how!!! Like actually how?? I don’t get it. How do I stop myself from screwing up my opportunity to show…", "Today TwitterChats\nIndia Time/IST\n12:30AM #EngChatUK #ContentChat #CommsChat #WealChat #CSAQT", "@Frenchhen74 as if if you cant be perfect you must be terrible? #CSAQT", "RT @CounsellingKaz: @lilgrace2911 @kykaree books are an incredible way to escape #CSAQT", "RT @CounsellingKaz: @kykaree hanks for such an honest admission #CSAQT", "@StevenJPayton I often felt and frequently was 'put down' dismissed, placed as a low achiever. My hobbies often use skills that prove them wrong. My hobbies in that way boost my self-esteem #csaqt", "We are getting into our last 10 mins of tonights #csaqt chat\nSo is there one thing, one hobby you would like to try? and why?", "RT @johnharvey1976: Good evening everyone and hope all is feeling well tonight. #csaqt", "@lilgrace2911 theory has to come before practice tho, its a vital step #CSAQT", "RT @7107Lilly: @green_pagan @kykaree @CSAQT Sometimes our self-criticism can keep us from enjoying and getting the self care benefits of ou…", "@Frenchhen74 I think most people start with Hornby train sets:)\n\n#csaqt", "@kykaree Do you make these Kylie? #csaqt", "RT @CounsellingKaz: here is a piece I wrote on cultivating resilience #csaqt https://t.co/JZsQJqcieU", "@Frenchhen74 @CounsellingKaz Difficult to accept praise when historically it was used to control #csaqt", "@WayneDenisMoore @shinybluedress @DavidLeanLeano @ChrisTuck_WWHF @RachelintheOC @jcstaff_ @DrAndyMayers @CestriaTherapy @Frenchhen74 @HayleyMcGregor1 @Sunnyclaribel #CSAQT (is what you need to search for - Sorry I just seen my typo!)", "RT @green_pagan: @lilgrace2911 Take care #csaqt", "Great mix of hobbies - restful and active - #csaqt https://t.co/xqz8EKUEzU", "RT @myworldmywords: @kykaree After being a cub, scout and police cadet I volunteered at the local beavers which was so much fun. I pulled o…", "@kykaree :) we are blessed :)\nwelcome to chat #csaqt", "RT @kykaree: I find non meditation mindfulness works for me. Putting things into perspective. A bad minute doesn't need to lead to bad day…", "RT @kykaree: I also love Hama beads either by myself, with my son or the beaver colony I help run  #CSAQT https://t.co/UPvc7IzIeW", "@kykaree we still need cosy clothes in spring lol #csaqt", "RT @CounsellingKaz: @cmwolfy12 it can be hard to learn to take constructive criticism as its intended #CSAQT", "RT @CounsellingKaz: @Frenchhen74 @johnharvey1976 when I had post natal depression the radio was a lifesaver #CSAQT", "@cmwolfy12 that can be such a healing and positive thing to do #CSAQT", "@green_pagan @CSAQT Finding the right yarn helps! Acrylic can make your work look a bit meh. #CSAQT", "@CounsellingKaz @kykaree Not as much damage as I've been known to people displaying their ignorance and prejudice and laying a shitload of stigma on me... #CSAQT https://t.co/xqk5pZp7po", "@myworldmywords @CSAQT @CounsellingKaz Quieter outdoor pursuits are nice..we get so much about the importance of exercise but sometimes it's just not possible #CSAQT", "I walk my beautiful dogs &amp; write poetry to try &amp; keep the dreaded demons of my past away. #hobbies #CSAQT https://t.co/3DA1mWmm47", "@cmwolfy12 Hi Wolfie\n#csaqt", "RT @CSAQT: I’m Sue @shinybluedress by the way. Lol #csaqt https://t.co/kR4s0gCw2U", "@kykaree yes! for me thats the take home point of today \n#CSAQT", "RT @CounsellingKaz: @kykaree hi kylie and bang on time! #CSAQT", "@cmwolfy12 @kykaree they are incredible! #CSAQT", "@johnharvey1976 I know what you mean. I have way more created and written in my head than I have the chance to write down. I should work on that, I guess. Allow myself a block of time each day. #csaqt", "RT @CounsellingKaz: @myworldmywords @kykaree its a completely unfounded prejudice but sadly most stigma is #CSAQT", "RT @Frenchhen74: @green_pagan @CounsellingKaz I find it hard to praise my children. I feel so bad about that. #csaqt", "@StevenJPayton I would like to do more outdoor activities maybe canoeing or sailing #CSAQT", "As a child I learnt the violin and this really helped me to get a voice. It also got me out of harms way at least once a week  #CSAQT", "I love writing too and kept a blog for quite some time, a bit about csa but mainly about the other big trauma I went through, the birth of my son  #csaqt", "@green_pagan I think that one of the reasons I like my railway models:)\n#csaqt", "Used to do cross stitching in the evenings but haven’t for a good few years now. I enjoyed it, though.#CSAQT", "When I was having therapy I drew a lot of pictures like my safe place in my mind and others to help release my inner child. I drew a lot as a child too  #CSAQT", "@CounsellingKaz Like, right now I’m battling my urges to self sabotage because I feel like if I’m less than perfect everything will fall apart. I feel angry and hurt and it’s tearing me to pieces. I can’t focus on anything. #csaqt", "@kykaree @CSAQT Love knitting &amp; crochet but end up annoyed with myself as I'm not that good #CSAQT", "@kykaree I love them #CSAQT", "@CSAQT Hey Sue #CSAQT", "@kykaree what do you knit kylie #CSAQT", "To everybody, those that feel able to join in the chat and those fellow travelers watching, welcome to #CSAQT tonight, Hail &amp; well met.", "here is a piece I wrote on cultivating resilience #csaqt https://t.co/JZsQJqcieU", "@CounsellingKaz May I add *have bath *cuddle a pet or a teddy or a human if you have decent one nearby free things for when you can't concentrate #csaqt", "I love writing and it is a cool way to get some of my feelings out. Not all of my feeling is from the abuse and just nice to get stuff out of my head into paper for other to see. #csaqt", "@StevenJPayton One thing about me I'm up for anything, give anything a go so who knows what I might try in the future #CSAQT", "RT @nathasurvivor: #metoo #Survivorculture #csaqt #sexabusechat 1 yr between those 2 pics.. before and after the 2nd sexual (cont) https://…", "@Eloc42617770 Hi David\nWelcome to chat #csaqt", "@kykaree @CounsellingKaz Your contribution are important. I was trying to say that perhaps being too positive can be a problem for us a well at time\nsorry if it came across as negative\n#csaqt", "@lilgrace2911 Has to be a conscious decision as difficult as that sounds it will happen. Recognising it is the first step #csaqt", "@green_pagan I’m trying my hardest to battle the urge to self sabotage. Seriously, I am. But I don’t know if it will work. I’m sat here shaking because I have an observation tomorrow and I need to do my marking but I can’t settle down to work. I’m literally driving myself crazy. #csaqt", "@lilgrace2911 Hi Lucy\nStay strong and look after your self\n#csaqt", "RT @CounsellingKaz: @Frenchhen74 I am thank you :-) #CSAQT", "@kykaree I think a lot of felt his loss\n#csaqt", "Music is very therapeutic #csaqt https://t.co/xktm2vPkKV", "@Frenchhen74 @shinybluedress Look at him/her, so cute. #csaqt", "@Frenchhen74 @green_pagan @CounsellingKaz Yeah I get this Hen... I feel I am not deserving or I’m unable to finish this degree. With a past like mine it’s kinda expected. Almost like I’m too damaged #csaqt", "@johnharvey1976 it sounds like you have learned to trust your gut, which is fab #CSAQT", "RT @StevenJPayton: So if I have a bad day waking up the next day I can feel negative about it right from th start. So how can we work on no…", "@johnharvey1976 wonderful advice! #CSAQT", "@lilgrace2911 @StevenJPayton I was feeling the same. But if we can’t say what we feel here, then where can we? #csaqt", "is there a way to predict days that we will struggle with?\n#csaqt", "RT @kykaree: @StevenJPayton So 'mindfulness' can be unhelpful for survivors as in meditation we can dissociate or bad feelings or memories…", "RT @johnharvey1976: I would love to learn how to make some mead and had it once many years ago but never stop loving how it tastes. #csaqt", "RT @Frenchhen74: @CounsellingKaz @green_pagan Yes I can relate to that. I feel uncomfortable if someone says I’ve done something well... I…", "@StevenJPayton @CSAQT Late to the party but hey. #CSAQT I enjoy watching @afcbournemouth and singing. I love trying new things. Did sewing but got out of it. But i have a new pillow so going to make a new case!", "@StevenJPayton Sounds like u were holding back telling us this? That looks like something to be proud about... like wow! #csaqt", "@lilgrace2911 @CounsellingKaz @StevenJPayton No... people come here to find others who have been through similar things to them, &amp; understand. Hearing how others cope &amp; what they feel helps so much to realise that they are not alone. #csaqt", "I also love Hama beads either by myself, with my son or the beaver colony I help run  #CSAQT https://t.co/UPvc7IzIeW", "RT @StevenJPayton: @CounsellingKaz Sometimes I have to tell myself that a day that wasnt 'wonderful' actually wasn't too bad after all\n#csa…", "@StevenJPayton Yes it builds self worth, confidence, self acceptance and value of ourselves. All of which are needed elsewhere in our lives #CSAQT", "RT @cmwolfy12: @Frenchhen74 @kykaree @CounsellingKaz Hahaha! Looks like he needs a belly rub #csaqt", "@StevenJPayton I think it starts from accepting its ok to have bad days, its not a failure #CSAQT", "@lilgrace2911 @green_pagan Maybe you have to believe in yourself. But I don’t have the instruction book for that, 😐 sorry. #csaqt", "RT @johnharvey1976: One of my painting. I have painted for a while but now just do some writing. #csaqt https://t.co/9K346rVDk8", "One of my painting. I have painted for a while but now just do some writing. #csaqt https://t.co/9K346rVDk8", "@StevenJPayton I think so. I love things that are outdoors, peaceful and meditative. #CSAQT", "@Frenchhen74 I have to wear mine for everything 😂#CSAQT", "I love art! I find there can be some peace in enjoying it and creating art. I think art can also be healing to us and for me, there is nothing like walking through an art gallery.  #csaqt", "RT @lilgrace2911: @kykaree I recently learned to knit. It’s very therapeutic. Helps keep my hands busy! #csaqt", "RT @shinybluedress: Twitterchat topic for CSA/CSE survivors on Mon April 23 at #CSAQT 8-9pm UK🇬🇧 \n(see @CSAQT ) https://t.co/4WAGAh9VjW", "RT @green_pagan: @lilgrace2911 Has to be a conscious decision as difficult as that sounds it will happen. Recognising it is the first step…", "RT @CounsellingKaz: having plans for when you are feeling low can really help, put them in place when things are OK, sometimes keeping a li…", "@CSAQT #CSAQT photography. This one was done by @btcc_crazy https://t.co/wbO6q6qyLl", "@kykaree @StevenJPayton @CounsellingKaz Oh Kylie, I love your contributions! They’re really helpful. #csaqt", "@StevenJPayton I tend to write down what made it bad. Is it external? Is it internal? Is it something I can change? Is there someone or something that can help? Do I need to be kind to myself and say no to something? #csaqt", "I think creating things; painting crafts pottery ... whatever are therapeutic in that they contrast with the mostly self-destructive urges I feel #csaqt", "RT @Frenchhen74: @CounsellingKaz It gets me really down if I disappoint someone or het criticism about something I’ve done. I just feel awf…", "I want to try horse riding my daughter does this and being around horses makes me feel very calm  #CSAQT", "@cmwolfy12 Sounds a great idea #csaqt", "@green_pagan @btcc_crazy Wow - awesome #csaqt", "@johnharvey1976 Thank you. I appreciate that. #CSAQT", "I’m having too many bad days at the mo due to stress and being overwhelmed need to lessen the load but can’t see how #CSAQT", "@StevenJPayton Dolores O'Riordan hit me hard too #csaqt", "@green_pagan @kykaree @CSAQT Sometimes our self-criticism can keep us from enjoying and getting the self care benefits of our hobbies. #csaqt", "@CounsellingKaz Hi Karen, I hope you’re well! #csaqt", "RT @StevenJPayton: Thank you EVERYBODY, Tweeters &amp; Fellow travelers alike for joining us @ #CSAQT tonight\nPlease practice good self care to…", "@lilgrace2911 Hey I resonate with so much of what u day and it helps me a lot don’t be sorry #csaqt", "@Trying2bBrave @CounsellingKaz I feel like that with a lot of things...that’s why my music rehearsals are good. I have to go #csaqt", "@Eloc42617770 I would love to make a sword. Traditional English pattern welding #csaqt", "@myworldmywords @kykaree @Luciek11K @CounsellingKaz I hadn’t thought of it, I will definitely try! Good idea. #csaqt", "I’m knee deep studying finding it very stressful so no time for hobbies. Makes me sad for myself but I know the end is near  #CSAQT", "RT @CounsellingKaz: Tonight on #CSAQT we are talking about bouncing back and how to have more good days. all welcome just use the # to join…", "@myworldmywords Hi Al\n\nGood to see you tonight\n#csaqt", "#csaqt I feel I'm probably a little warped but an \"early night\" is my go to", "@johnharvey1976 I think just making sounds is very healing who cares if you can't carry a tune! I love to make music I'm never going to be a star but I don't care #csaqt", "Good evening all #CSAQT", "@CounsellingKaz This is where mindfulness can help but not the scary kind. Recognising our feelings and putting them into perspective and looking at ways we can turn things around #csaqt", "RT @StevenJPayton: Tonights chat is about our hobbies.\nWhat do we like to do in our down time?\nhow do they help us?\n#csaqt", "@CounsellingKaz I have a wellness recovery action plan that really works for me there are some great templates on the internet but best to have some support to fill it out #csaqt", "@johnharvey1976 Music can definitely help, we are going to have a topic on week on it :)\nWhy do you think music helps?\n#csaqt", "RT @StevenJPayton: We are getting into the last 10 mins of tonights Chat.\nSo is there something, a thought maybe, that you can go to to sta…", "RT @cmwolfy12: @lilgrace2911 @CounsellingKaz @Frenchhen74 @StevenJPayton Everything u you tweet I recognise in me and that helps me identif…", "RT @shinybluedress: Join us for the last half hour at #CSAQT https://t.co/g4s4g05rdo", "RT @Eloc42617770: I think mine are all things that people who abused me said I couldn’t or shouldn’t do. They are stereotypical male things…", "RT @CSAQT: Maybe this could be a twitter thing? The aim could be to tweet one thing &amp; a photo each day of something you’ve done that’s good…", "@Frenchhen74 Hi Hen :)\n#csaqt", "RT @green_pagan: @StevenJPayton @CSAQT Arghhhhhhhh 🤘#CSAQT", "RT @StevenJPayton: @CSAQT @myworldmywords Getting away yes, camping??? Absolutely not :)\nI go on rail rovers to get away\n#csaqt", "@johnharvey1976 thats beautiful John! #CSAQT", "RT @green_pagan: @StevenJPayton @kykaree Geocaching....I do it with my son, incorporates exercise, nature, adventure and it's free #CSAQT", "@StevenJPayton Blacksmithing, in particular making axes, hatchets, hammers. It seems so cool to actually MAKE something. And lots of time involved. #CSAQT", "@CounsellingKaz I get it in theory. But in practise...#csaqt", "RT @kykaree: @StevenJPayton I would like to do more outdoor activities maybe canoeing or sailing #CSAQT", "@CounsellingKaz It makes me feel so useless, and that even when I try, I just can’t get it right. I always try to be a nice person &amp; do things the best possible, while being convinced that I’m not. When someone lets me know that I’m not, it’s like they’re confirming what I knew all along #csaqt", "@CuriousQualia Welcome to chat\n#csaqt", "RT @StevenJPayton: @lilgrace2911 You arnt 'inflicting' anything on anybody\nWe al value your thoughts\n#csaqt", "RT @StevenJPayton: So I am just going to have to admit it.\nI like model railways. It’s taken over one of the bedrooms....\n#csaqt https://t.…", "RT @CounsellingKaz: music can be one of the best ways of raising your mood #CSAQT https://t.co/sNn9KCvQ7W", "RT @CounsellingKaz: @kykaree thanks for sharing such great ideas #CSAQT", "@green_pagan thats amazing! #CSAQT", "RT @StevenJPayton: Welcome Kylie :)\n#csaqt https://t.co/cPPlrqTYgU", "RT @CounsellingKaz: @Trying2bBrave sometimes self care is about not doing as much as it is about doing #CSAQT", "@Frenchhen74 why do you think criticism hurts so much Hen #CSAQT", "@Frenchhen74 I am thank you :-) #CSAQT", "@Trying2bBrave sometimes self care is about not doing as much as it is about doing #CSAQT", "Twitterchat topic for CSA/CSE survivors this evening at #CSAQT 8-9pm UK🇬🇧 \n(see @CSAQT ) https://t.co/DmlTaLJjic", "RT @green_pagan: @lilgrace2911 I have found over the past year allowing myself to do things that have the potential to hurt me has been lib…", "A walk in the park and especially after it rain can be so soothing. Listening to the sound of nature on a cd can also be nice and healing for me. #csaqt", "no matter if you feel OK to join in the chat, or just watch from the sidelines remember you are always welcome to #csaqt", "RT @kykaree: I love using really nice wools and making things mainly for me like these socks!  #csaqt https://t.co/wiPOHsKmV3", "@kykaree hi kylie and bang on time! #CSAQT", "RT @StevenJPayton: @johnharvey1976 Music can definitely help, we are going to have a topic on week on it :)\nWhy do you think music helps?\n#…", "@StevenJPayton @CounsellingKaz In a really deep and meaningful way rather than just glib platitudes like 'it will pass' you might have to do something to help it pass #csaqt", "Today TwitterChats\nBST Time/GMT+1\n8PM #EngChatUK #ContentChat #CommsChat #WealChat #CSAQT", "@CounsellingKaz @kykaree The worst thing was she wanted to go to uni to be a teacher or social worker... I sincerely hope she failed to make the grade cause Christ knows how damaging she would have been with vulnerable children / adults #CSAQT", "@kykaree @Luciek11K @Frenchhen74 @CounsellingKaz Would audio books help when reading is difficult? #csaqt", "@green_pagan @Frenchhen74 self sabotage can be a huge issue, it often relates to feeling we dont deserve good things, or even that things being ok feels scary #csaqt", "So, how do I prevent myself from self sabotaging? I can now recognise that I’m doing it, but how the heck do I stop??!!#csaqt", "@StevenJPayton definitely, especially in my poetry #CSAQT", "RT @green_pagan: @StevenJPayton @kykaree @CounsellingKaz Remembering it's only a feeling/memory you are not back there now. You can escape…", "@Eloc42617770 Had a lot of help. It was a course run by an archeologist\n#csaqt", "@myworldmywords ⛺️ Camping!!! Getting away from it all once in a while is so important I think #csaqt", "wonderfully put! #CSAQT https://t.co/AOyR6nmvbc", "RT @StrongWalkAlone: @myworldmywords @7107Lilly @green_pagan @kykaree @CSAQT @KyraWomen I enjoy my poetry but don’t really see that as art.…", "RT @HayleyMcGregor1: \"You're not a victim for sharing your story. You are a survivor setting the world on fire with your truth...\" #YouAreN…", "RT @kykaree: @Frenchhen74 @lilgrace2911 @StevenJPayton We are all at different parts of our journey. #csaqt", "@StrongWalkAlone @7107Lilly @kykaree @CSAQT I'm sorry that happened to you. She was wrong #CSAQT", "RT @myworldmywords: @kykaree @Luciek11K @Frenchhen74 @CounsellingKaz Would audio books help when reading is difficult? #csaqt", "music can be one of the best ways of raising your mood #CSAQT https://t.co/sNn9KCvQ7W", "@StevenJPayton So 'mindfulness' can be unhelpful for survivors as in meditation we can dissociate or bad feelings or memories can come up. But cognitive based mindfulness can be really effective. #csaqt", "Welcome to our twitterchat Kira #CSAQT https://t.co/MIdlwnzI6w", "RT @green_pagan: @kykaree @CSAQT Love knitting &amp; crochet but end up annoyed with myself as I'm not that good #CSAQT", "@StevenJPayton I'm seriously dubious that my hobbies are appropriate for tonight's chat 😂😂 #CSAQT", "RT @kykaree: @green_pagan @CSAQT Finding the right yarn helps! Acrylic can make your work look a bit meh. #CSAQT", "@Frenchhen74 @CSAQT hello hen great to see you! #CSAQT", "Goodnight everyone. Take care of yourselves #CSAQT", "Really enjoyed the twitterchat tonight - thank you everyone for joining in. Take care x\n#CSAQT", "Good evening wonderful #CSAQT folks hope you are all well, sorry for my slacking the last 2 weeks https://t.co/3OTlkvBihI", "RT @green_pagan: @CSAQT Yes heavy metal #CSAQT", "RT @CounsellingKaz: Learning not to blame yourself for feeling low is hugely important too, its OK to have a bad day, it doesnt make you we…", "@StrongWalkAlone I love them! They are very soft and warm #csaqt", "@johnharvey1976 Truly beautiful @johnharvey1976 you have serious talent #CSAQT", "RT @green_pagan: @Frenchhen74 @CounsellingKaz Difficult to accept praise when historically it was used to control #csaqt", "@Luciek11K @Frenchhen74 @CounsellingKaz I have difficulties with reading. I love it but it can cause me to dissociate so I have to be careful #csaqt", "@StrongWalkAlone @7107Lilly @green_pagan @kykaree @CSAQT That’s very sad. I’m sure you are great at arty stuff! #csaqt", "@shinybluedress Walking, hiking and cycling are my all time favorite activities/hobbies as they are rhythmic and get me out in the fresh air and nature, engage my senses and get me out of my head. #csaqt", "RT @kykaree: @CounsellingKaz Firstly checking in 'I'm breathing quicker, I'm feeling hot, I have tightness' then 'what's causing this?' Sme…", "RT @CuriousQualia: @StevenJPayton I often felt and frequently was 'put down' dismissed, placed as a low achiever. My hobbies often use skil…", "@lilgrace2911 @CounsellingKaz @Frenchhen74 @StevenJPayton Everything u you tweet I recognise in me and that helps me identify how I am feeling. That helps me and supports me #csaqt", "RT @cmwolfy12: I have a journal which I write about what I’ve done to be proud about. I try and write at least one thing per day  #CSAQT", "RT @myworldmywords: this is one of my favourite hobbies https://t.co/kxNHTENtUP it means I can get away from everything, connect to nature,…", "@StevenJPayton I try to by making things for charity, going along to different groups. I'd love to start a Survivors craft group #csaqt", "good night everyone, remember to look after yourselves, the feelings raised by chat can often linger afterwards &lt;3 #CSAQT", "@StrongWalkAlone @myworldmywords @green_pagan @kykaree @CSAQT @KyraWomen I would definitely consider poetry an art! 😊 The art of words. #csaqt", "Join @CounsellingKaz and @StevenJPayton for this weeks twitterchat at #CSAQT https://t.co/Kv6HwrtlNa", "@green_pagan But how!!! Like actually how?? I don’t get it. How do I stop myself from screwing up my opportunity to show my deputy head that I’m not an idiot or a complete waste of space?? #csaqt", "@kykaree can you share anything thats worked for you kylie #CSAQT", "RT @CounsellingKaz: @cmwolfy12 fingers crossed for you wolfie #CSAQT", "RT @CounsellingKaz: perfectionism can be a huge issue for surviours, because children often search for the reason abuse happens, and decide…", "@Trying2bBrave @CounsellingKaz Welcome to tonights #csaqt chat", "@StevenJPayton @kykaree @CounsellingKaz Remembering it's only a feeling/memory you are not back there now. You can escape now you are in control #csaqt", "I’m in awe of all your hobbies and crafts I can’t wait to get some free time and do stuff. Some great ideas here  #CSAQT", "RT @CounsellingKaz: things that could go on a self care list \nhttps://t.co/5rZca7mfiI shows that you enjoy\n2. favourite books\n3. Moisturing…", "@green_pagan @StevenJPayton @kykaree thank you! #csaqt sounds so much fun", "@7107Lilly @green_pagan @kykaree @CSAQT I can’t do arts and crafts where mum always binned stuff I made saying it was all rubbish etc #CSAQT", "RT @kykaree: @StrongWalkAlone I think it's just a nasty rumour, it doesn't exist #csaqt", "RT @StevenJPayton: To everybody, those that feel able to join in the chat and those fellow travelers watching, welcome to #CSAQT tonight, H…", "RT @cmwolfy12: I want to try horse riding my daughter does this and being around horses makes me feel very calm  #CSAQT", "#metoo #Survivorculture #csaqt #sexabusechat 1 yr between those 2 pics.. before and after the 2nd sexual (cont) https://t.co/j4PjKGgSuj", "RT @StevenJPayton: @Eloc42617770 I would love to make a sword. Traditional English pattern welding #csaqt", "@CSAQT Burning art onto wood #CSAQT", "@CSAQT @myworldmywords Getting away yes, camping??? Absolutely not :)\nI go on rail rovers to get away\n#csaqt", "I have a journal which I write about what I’ve done to be proud about. I try and write at least one thing per day  #CSAQT", "@CounsellingKaz No just material things. You end up putting more effort into non material things that nobody can break or take from you #CSAQT", "Good evening everyone and hope all is feeling well tonight. #csaqt", "RT @johnharvey1976: I bounce back with music and is the best medicine for me on a bad day.#csaqt", "RT @CounsellingKaz: @green_pagan @Frenchhen74 @lilgrace2911 @shinybluedress this is how I sometimes describe therapy #CSAQT", "Thank you EVERYBODY, Tweeters &amp; Fellow travelers alike for joining us @ #CSAQT tonight\nPlease practice good self care today everyone. Chat can be triggering even hours afterward. #csaqt", "RT @CounsellingKaz: @StevenJPayton this is such an important re-framing #CSAQT", "RT @StevenJPayton: Thanks to everyone who joined us tonight, to @shinybluedress for retweeting chat and @CounsellingKaz for facilitating\n#c…", "@kykaree It’s important to find a way to express ourselves. Good to hear this worked for you Kylie #csaqt", "I used to draw and paint but don't have time now #CSAQT this is one of mine https://t.co/5PzXjEHS50", "RT @StevenJPayton: Remember you are all always welcome to #csaqt chats. Whether you feel OK to participate, watch from the side or catch up…", "@StevenJPayton @CounsellingKaz Thank you Steven 🌻 #CSAQT", "I wish there was enough space to share my writing here and sadly space is limited.  #csaqt", "RT @kykaree: @StevenJPayton Mindfulness CBT is the best thing to Google. It means to use conscious awareness to help get perspective so e.g…", "@kykaree Can you expand a bit on Non meditation Mindfulness?\n#csaqt", "RT @lilgrace2911: @Frenchhen74 @CSAQT @CounsellingKaz I struggle with this so much, especially with my work. Which is a problem as my work…", "@CounsellingKaz Sometimes I have to tell myself that a day that wasnt 'wonderful' actually wasn't too bad after all\n#csaqt", "I might hold you to that Kirsty lol \n(sue)\n#csaqt https://t.co/YO2g12fptp", "@kykaree I totally agree. #csaqt https://t.co/dL25ITffUI", "@kykaree That people still have that prejudice that victims go onto be perps, even though statistically isn't the case. I feel more vulnerable around vulnerable people, not because I'm a risk, but because of what judgments are being made about me #stigma #csaqt", "@Eloc42617770 Oh sorry lol - I’m struggling to keep up with the twitterchat lol #csaqt", "@green_pagan @StevenJPayton @kykaree could you explain to ppl what geocaching is kirsty? #CSAQT", "RT @johnharvey1976: I do need alone time when I am hurting and listen to some @emilieautumn #csaqt to make things better.", "@green_pagan @kykaree Nice.\n:)\n#csaqt", "@StevenJPayton this is such an important re-framing #CSAQT", "Tonights #CSAQT brought to U by the letter B, Bouncing Back\n\nWe all have bad days, so how do we survive them and how do we move on from them?\nHow can we build resilience to cope with them better?\nAnd how can we have more good days? https://t.co/fW3xlIaNxV", "This weeks twitterchat for CSA and CSE survivors &amp; supporters is focused around hobbies\n\nBecause we are MUCH more than what happened to us.\n\nJoin the conversation\nApril 16th 8-9pm UK🇬🇧\nat the hashtag #CSAQT https://t.co/9DOGmbvKCo", "RT @CounsellingKaz: @green_pagan hi Kristy great you could make it! #CSAQT", "Tonights #CSAQT brought to U by the letter H, Hobbies\n\nDo your hobbies help you cope when times get rough?\nHow do your hobbies show that you are more than what happened to you?\nHow do you hobbies fit into your life? https://t.co/ap6LREijOY", "RT @CounsellingKaz: good night everyone, remember to look after yourselves, the feelings raised by chat can often linger afterwards &lt;3 #CSA…", "What a lovely chat tonight it's been so nice sharing something so positive  #CSAQT", "RT @shinybluedress: How do your hobbies/pastimes help you cope? Join us in an hour at this twitterchat.\nDon’t forget to use the hashtag #CS…", "@StevenJPayton @CSAQT Arghhhhhhhh 🤘#CSAQT", "@StevenJPayton @kykaree Geocaching....I do it with my son, incorporates exercise, nature, adventure and it's free #CSAQT", "RT @CounsellingKaz: @cmwolfy12 Hi wolfie! Hope you are wll #CSAQT", "RT @shinybluedress: Thank you Pooky #csaqt https://t.co/lKKwrEjGSn", "RT @Frenchhen74: @kykaree @CounsellingKaz This one cheers me up! #csaqt https://t.co/MSJSEU7Jxb", "good evening everyone, and I hope tonight we can share ideas, and support each other, which I think lies at the heart of this topic, recognising no one gets everything perfect all the time #CSAQT", "@cmwolfy12 can you cut out things that you dont need to be doing right now to lessen the load  #CSAQT", "RT @johnharvey1976: I love art! I find there can be some peace in enjoying it and creating art. I think art can also be healing to us and f…", "@green_pagan Hi Kirsty\n#csaqt", "RT @CounsellingKaz: @myworldmywords @kykaree I am so sorry you had to hear that Al #CSAQT", "Twitterchat topic for CSA/CSE survivors on Mon April 23 at #CSAQT 8-9pm UK🇬🇧 \n(see @CSAQT ) https://t.co/4WAGAh9VjW", "@kykaree I nearly dropped my tablet, thought that was a snake... one of my biggest phobias #csaqt", "RT @Frenchhen74: @green_pagan @CounsellingKaz I try really hard not to, but when I do, I sort of feel that that is what is expected of me #…", "Thank you Pooky #csaqt https://t.co/lKKwrEjGSn", "RT @CSAQT: Oh no. So sad. So hurtful. Maybe one day you’ll be able to try something creative again without that critical voice ruining the…", "RT @CounsellingKaz: @cmwolfy12 can you cut out things that you dont need to be doing right now to lessen the load  #CSAQT", "RT @Frenchhen74: @cmwolfy12 @green_pagan @CounsellingKaz You’ll get your degree because you deserve it! #csaqt", "RT @Frenchhen74: @lilgrace2911 @StevenJPayton I was feeling the same. But if we can’t say what we feel here, then where can we? #csaqt", "Wow!!! Got any photos David? Sue x\n#csaqt https://t.co/As91JzCFdw", "perfectionism can be a huge issue for surviours, because children often search for the reason abuse happens, and decide if they could be perfect it would stop- some abusers even encourage this belief #CSAQT", "RT @kykaree: Panic attacks and the fear of them used to rule my life. I had CBT then mindfulness and created my own safe techniques to help…", "RT @green_pagan: @CounsellingKaz @StevenJPayton @kykaree It's a global treasure hunt using a GPS device. Containers hidden all over the pla…", "Good evening everyone and hope all is doing good tonight. #csaqt", "Welcome Hen! Lovely to see you! It’s Sue here #CSAQT https://t.co/AZbUXVf3Te", "RT @CSAQT: This.... #csaqt https://t.co/kaRL19ycoT", "Panic attacks and the fear of them used to rule my life. I had CBT then mindfulness and created my own safe techniques to help me through hard times  #CSAQT", "RT @kykaree: @StevenJPayton I tend to write down what made it bad. Is it external? Is it internal? Is it something I can change? Is there s…", "@Frenchhen74 @kykaree @CounsellingKaz Hahaha! Looks like he needs a belly rub #csaqt", "@cmwolfy12 fingers crossed for you wolfie #CSAQT", "Welcome everyone to our twitterchat hour at #CSAQT\nI’m Sue Crocombe, retweeting from this account until 9pm", "Evening folks I'm not late! That's 2 weeks in a row  #CSAQT", "RT @shinybluedress: This weeks twitterchat for CSA and CSE survivors &amp; supporters is focused around hobbies\n\nBecause we are MUCH more than…", "RT @cmwolfy12: @StevenJPayton Sounds like u were holding back telling us this? That looks like something to be proud about... like wow! #cs…", "RT @cmwolfy12: I relate to the perfectionism I’ve had some negative feedback on my academic work which I spent ages on took days recovering…", "RT @kykaree: @CounsellingKaz This is where mindfulness can help but not the scary kind. Recognising our feelings and putting them into pers…", "@StevenJPayton I play saxophone &amp; have music rehearsal every Friday evening. Even though sometimes I really don’t feel like going, I always feel better once there. #csaqt", "Hi all, hope you’re ok. I’m struggling with feelings right now. But I’m trying my best to hold on. #CSAQT hobbies of mine include reading, Climbing and crafting.", "RT @Frenchhen74: @kykaree @StevenJPayton @CounsellingKaz Oh Kylie, I love your contributions! They’re really helpful. #csaqt", "@CounsellingKaz Hi, I'm just spectating tonight. Really interesting learning about what everyone does in their spare time or for self care ❤  #CSAQT", "RT @StevenJPayton: @johnharvey1976 Hi John welcome to tonights chat\n#csaqt", "This.... #csaqt https://t.co/kaRL19ycoT", "@CounsellingKaz @StevenJPayton @kykaree It's a global treasure hunt using a GPS device. Containers hidden all over the place you have to find them sometimes walking miles sometimes have to complete puzzles to find coordinates #CSAQT", "@StevenJPayton I think you have to be careful with this as it can become a self fulfilling prophecy, I try and think of every day as a clean slate. I have 100% success rate of surviving every day even the really tough ones #csaqt", "RT @7107Lilly: @johnharvey1976 @StrongWalkAlone @green_pagan @kykaree @CSAQT I so agree John Harvey. Very well said. #csaqt", "RT @kykaree: @CounsellingKaz May I add *have bath *cuddle a pet or a teddy or a human if you have decent one nearby free things for when yo…", "Good night all and hope everyone will have a trigger-free sleep tonight. #csaqt", "RT @kykaree: I also joined Brownies which helped and now I'm a Beaver scout leader  #CSAQT", "A bad minute doesn't need to lead to a bad day #Truth! #CSAQT https://t.co/VP6Zu3x8BH", "My hobbies are walking &amp; cycling... which I find very therapeutic - a way to fight off that big black dog\n❤️Dorset\n#CSAQT https://t.co/2xSxQaYYMj", "@shinybluedress Thank you Sue. I enjoyed it so much also, though I had to disappear near the end to feed my cats. 😺🐈 Good night everyone! #CSAQT", "@Frenchhen74 Goodnight Hen! Take good care. 😺 #csaqt", "@StevenJPayton Hi Steven, how are you doing? #csaqt", "RT @carynwalker4: @Frenchhen74 @shinybluedress Look at him/her, so cute. #csaqt", "@green_pagan Thanks for joining us Kirsty #CSAQT", "RT @CounsellingKaz: As you may have guessed one of my hobbies is photography #CSAQT https://t.co/lYpopvjkKU", "So if I have a bad day waking up the next day I can feel negative about it right from th start. So how can we work on not letting a bad day spill over to the next?\n#csaqt", "RT @StevenJPayton: @cmwolfy12 its a little geeky I guess.\nAnd sometimes I do think its more the little boy in me wanting to do it.\nBut ther…", "@StevenJPayton There’s a guy over there in the U.K. who does classes. I used to follow him on Instagram. I’d love to take his class. #CSAQT", "RT @kykaree: I love playing Pokemon go. I had severe panic attacks following my break down and my then 6 year old son suggested I play so I…", "@green_pagan @StevenJPayton @kykaree We used to do this it’s amazing. Love finding all the little caches #csaqt", "@CounsellingKaz True. I guess. #csaqt", "RT @CounsellingKaz: @johnharvey1976 thats beautiful John! #CSAQT", "And I get to meet these beautiful creatures\n#csaqt https://t.co/bHAYlHPiMD", "RT @StevenJPayton: @Trying2bBrave @CounsellingKaz Welcome to tonights #csaqt chat", "RT @lilgrace2911: @StevenJPayton It’s actually more that I don’t feel it’s fair to inflict my negativity on a positive chat. #csaqt", "@cmwolfy12 its a little geeky I guess.\nAnd sometimes I do think its more the little boy in me wanting to do it.\nBut there is something about building a little world all to scale and getting it working\n#csaqt", "@CSAQT I’m very good at putting myself down so this makes me focus on at least one good thing I’ve done each day. Sometimes more! #csaqt", "RT @7107Lilly: @StrongWalkAlone @myworldmywords @green_pagan @kykaree @CSAQT @KyraWomen I would definitely consider poetry an art! 😊 The ar…", "RT @Frenchhen74: Used to do cross stitching in the evenings but haven’t for a good few years now. I enjoyed it, though.#CSAQT", "@CounsellingKaz Now I think you think I'm being too glib and positive 😂#csaqt", "@green_pagan @Frenchhen74 @lilgrace2911 @shinybluedress this is how I sometimes describe therapy #CSAQT", "What is that? #csaqt https://t.co/eV0NTZHkw5", "RT @myworldmywords: @CounsellingKaz @kykaree Thank you for putting it so succinctly Karen, I remember a massive argument at college 15 year…", "RT @kykaree: @johnharvey1976 I love music for that #csaqt", "RT @StevenJPayton: Tonight @shinybluedress will be on the @csaqt retweet &amp; @CounsellingKaz facilitating\n#csaqt", "@StevenJPayton Hi everyone #CSAQT", "@myworldmywords @kykaree I am so sorry you had to hear that Al #CSAQT", "RT @lilgrace2911: @green_pagan I’m trying my hardest to battle the urge to self sabotage. Seriously, I am. But I don’t know if it will work…", "RT @green_pagan: @CSAQT Hey Sue #CSAQT", "@johnharvey1976 is that a tropical plant? #csaqt looks like a triffid!", "@Frenchhen74 @CounsellingKaz Or to give praise for that matter. Another concsious decision for me. Goes against my grain to praise because of my history but I realised most people actually need it #csaqt", "RT @kykaree: Evening folks I'm not late! That's 2 weeks in a row  #CSAQT", "@kykaree They're wonderful! 😊 #CSAQT", "@StrongWalkAlone And summer 😂#csaqt", "RT @StevenJPayton: @kykaree @CounsellingKaz So its sort of being aware of how we feel? accepting it and not letting it take over?\n#csaqt", "@7107Lilly @StrongWalkAlone @green_pagan @kykaree @CSAQT I agree with Kira, maybe if you found the right environment to nurture your creativity, in York we have @KyraWomen who is a women's support group and often do artsy things... one thing to remember Michelle is that the arts are subjective, there are not rights or wrongs #CSAQT", "@myworldmywords sounds like a great way to leave the world behind #CSAQT", "I love using really nice wools and making things mainly for me like these socks!  #csaqt https://t.co/wiPOHsKmV3", "RT @StrongWalkAlone: @kykaree I totally agree. #csaqt https://t.co/dL25ITffUI", "@Frenchhen74 @lilgrace2911 @StevenJPayton and you both are such valued tweeters, and your honesty will help many silently feeling the same #CSAQT", "I'm twitting 🤣 #CSAQT https://t.co/4mnGRf77i6", "It’s that internal critic saying I can’t do it which has normally succeeded but I won’t allow it this time it can’t beat me #CSAQT", "RT @kykaree: @StrongWalkAlone And summer 😂#csaqt", "RT @kykaree: @StevenJPayton I think you have to be careful with this as it can become a self fulfilling prophecy, I try and think of every…", "Remember you are all always welcome to #csaqt chats. Whether you feel OK to participate, watch from the side or catch up later you are all most welcome.", "@lilgrace2911 @CounsellingKaz It's absolutely true. For me understanding my trauma responses and that actually my body and mind thinks it's being useful when in fact it's on hyper alert has really helped #csaqt", "RT @StevenJPayton: Tonights #CSAQT brought to U by the letter B, Bouncing Back\n\nWe all have bad days, so how do we survive them and how do…", "when something upsetting happens, or you wake up in a low mood this perfectionism can come into play, as \"jerk brain\" insists the day is ruined #CSAQT", "@CounsellingKaz Yeah I’ve been trying. Asking for help etc but still I feel inadequate. I know it will pass and get easier once I finished the degree  #csaqt", "RT @Frenchhen74: I’m not being very good about getting out &amp; doing new stuff at the moment. Just clinging to what I know. #CSAQT", "@Eloc42617770 I made a replicat bronze age bronze knife once, from making the bronze, casting and then finishing\n#csaqt", "@shinybluedress Just bought a bike :)\nneed to try and get at least a little fitter :)\n#csaqt", "@kykaree I recently learned to knit. It’s very therapeutic. Helps keep my hands busy! #csaqt", "@Frenchhen74 I feel the same way about going to a model railway club.\neven though everybody there is so much better at it than me :)\n#csaqt", "Goodnight all, take care of yourselves xx #CSAQT", "RT @StevenJPayton: @kykaree So how would cognitive mindfulness work?\nIm not sure I have come across that\n#csaqt", "@kykaree They are fab! #csaqt", "Thank you so much everyone for joining in, it’s been good to get to hear about the things you enjoy doing in spare time.\nNever ever forget that we are SO much more than what happened to us.\n#CSAQT", "@kykaree Absolutely! #csaqt", "@CounsellingKaz @Trying2bBrave I like that. #CSAQT", "RT @cmwolfy12: It’s that internal critic saying I can’t do it which has normally succeeded but I won’t allow it this time it can’t beat me…", "@johnharvey1976 That’s brill #csaqt", "@Frenchhen74 @shinybluedress I'm sure the distraction will help ;) #csaqt", "RT @CounsellingKaz: @Frenchhen74 Hi Hen! welcome to chat #CSAQT", "And take these beautiful creatures with me #CSAQT https://t.co/KpY2uIeMWo", "RT @kneaverchat: Today TwitterChats\nUS Pacific/PT\n12PM #EngChatUK #ContentChat #CommsChat #WealChat #CSAQT", "@lilgrace2911 Take care #csaqt", "RT @kykaree: @lilgrace2911 @CounsellingKaz It's absolutely true. For me understanding my trauma responses and that actually my body and min…", "@Frenchhen74 @carynwalker4 You’ll be proper distracted with a puppy! How lovely! And then you’ll HAVE to walk it, even when you’re too low to go out, you have to think of the dog #csaqt", "@CSAQT Im up for that @CSAQT although may need reminding I have a head like a seive #CSAQT", "RT @Frenchhen74: @StrongWalkAlone @7107Lilly @green_pagan @kykaree @CSAQT That’s very sad. I’m sure you are great at arty stuff! #csaqt", "@kykaree @CounsellingKaz So its sort of being aware of how we feel? accepting it and not letting it take over?\n#csaqt", "RT @StevenJPayton: @shinybluedress Just bought a bike :)\nneed to try and get at least a little fitter :)\n#csaqt", "Oh no. So sad. So hurtful. Maybe one day you’ll be able to try something creative again without that critical voice ruining the joy of it #CSAQT https://t.co/ZqFDO7Nu84", "@CSAQT Thanks. I do my best. #CSAQT", "RT @CounsellingKaz: @myworldmywords sounds like a great way to leave the world behind #CSAQT", "RT @shinybluedress: How to hurt your child in one easy lesson.\n#csaqt https://t.co/JjzKdZHoNG", "@Frenchhen74 @CounsellingKaz Yes exactly...it's frustrating...it used to scare me that the reading would never come back but I tell myself now it comes and goes #CSAQT", "RT @johnharvey1976: Good night all and hope everyone will have a trigger-free sleep tonight. #csaqt", "RT @Frenchhen74: @lilgrace2911 @CounsellingKaz @StevenJPayton No... people come here to find others who have been through similar things to…", "@Frenchhen74 I am managing today thank you\n#csaqt", "@CounsellingKaz @kykaree Thank you for putting it so succinctly Karen, I remember a massive argument at college 15 years ago where I walked out the classroom telling a woman to stick her daily mail attitude up her arse when she said eugenics should be used on male survivors of abuse #CSAQT", "@cmwolfy12 Hi wolfie! Hope you are wll #CSAQT", "\"You're not a victim for sharing your story. You are a survivor setting the world on fire with your truth...\" #YouAreNotAlone #csaqt #Truth https://t.co/kKhnU0X0Sg", "RT @CounsellingKaz: good evening everyone, and I hope tonight we can share ideas, and support each other, which I think lies at the heart o…", "RT @kykaree: @CounsellingKaz Now I think you think I'm being too glib and positive 😂#csaqt", "Today TwitterChats\nUS East Time/ET\n3PM #EngChatUK #ContentChat #CommsChat #WealChat #CSAQT", "Tonight on #CSAQT we are talking about bouncing back and how to have more good days. all welcome just use the # to join in, starts at 8pm UK time", "RT @cmwolfy12: @green_pagan @StevenJPayton @kykaree We used to do this it’s amazing. Love finding all the little caches #csaqt", "@StevenJPayton @CSAQT Sorry I missed the chat tonight. It's been mad today with the recent news that the government have allocated £6 million to children of #alcoholics! Progress is happening. #CSAQT", "RT @green_pagan: @Frenchhen74 @CounsellingKaz Do any of you guys fuck up on purpose? #csaqt", "RT @CounsellingKaz: @green_pagan Hi Kirsty. great to see you here #CSAQT", "Today TwitterChats\nUS Pacific/PT\n12PM #EngChatUK #ContentChat #CommsChat #WealChat #CSAQT", "RT @StevenJPayton: is there a way to predict days that we will struggle with?\n#csaqt", "I do cook as a way of relaxing  #CSAQT", "RT @StevenJPayton: This weeks twitterchat for CSA and CSE survivors &amp; supporters is focused around hobbies\n\nBecause we are MUCH more than w…", "RT @cmwolfy12: Goodnight #CSAQT", "this is one of my favourite hobbies https://t.co/kxNHTENtUP it means I can get away from everything, connect to nature, have a beer and cig and be totally in the moment without a smug mindfulness teacher telling me how to be mindful \n#CSAQT", "My hobbies are exercising and walking. I also enjoy writing.  #CSAQT", "@johnharvey1976 I love music for that #csaqt", "RT @kykaree: @CSAQT I love the feel of the wool and use vibrant colours it really helps #csaqt", "RT @shinybluedress: I’d like to learn badminton #csaqt https://t.co/VH8jKOggW9", "Tonight @shinybluedress will be on the @csaqt retweet &amp; @CounsellingKaz facilitating\n#csaqt", "@carynwalker4 @shinybluedress I like walking, although sometimes I find black thoughts clogging up my mind. Am hoping that with our puppy this will no longer be the case! #csaqt", "RT @Frenchhen74: @green_pagan @lilgrace2911 I find that the further I go, &amp; the more consious I become of my ways of reacting, &amp; how they a…", "RT @cmwolfy12: It’s so easy just to give in but then I’m filled with regret and disappointment #CSAQT", "Goodnight everyone #CSAQT", "@shinybluedress @CSAQT @DavidLeanLeano @ChrisTuck_WWHF @Sunnyclaribel @rights_victims @CestriaTherapy @DrAndyMayers @madblack65 @johnharvey1976 @HayleyMcGregor1 @Beyond_Survivor Man I need this so much! I am struggling with this bounce back ability! #csaqt.", "RT @cmwolfy12: Whatever we are doing we are trying our best with what we have been through and we can go on to succeed in whatever we need…", "@myworldmywords Hi Al, and no need to apologize, its just great you made it this week! #CSAQT", "RT @kykaree: I'm feeling guilty for being too positive, sometimes you just can't win  #CSAQT", "RT @myworldmywords: @CounsellingKaz I'd love to set up some fishing for therapy group, what better place to learn mindfulness than on a lak…", "I wish that I could sing and I sound like a dying cow in a hail storm but don't stop me from trying. lol I wished I could also play the piano or a violin.  #csaqt", "RT @StevenJPayton: @cmwolfy12 Hi Wolfie\n#csaqt", "RT @kykaree: I love celebrating the seasons with crafts like these eggs  #CSAQT https://t.co/rSL5wBPVWX", "@green_pagan @CounsellingKaz I try really hard not to, but when I do, I sort of feel that that is what is expected of me #csaqt", "@StevenJPayton @shinybluedress @CounsellingKaz Goodnight Steven! Take good care. 😺 #csaqt", "@StevenJPayton Model railways are great fun - I used to love my brothers’ one when I was young. It was a Hornby one. #csaqt", "any suggestions #csaqt tweeps https://t.co/OsAtqkozRz", "@vibrantSun44 Thank you. I’m not alone, I know that. #csaqt", "@shinybluedress @sarah_wigington @DavidLeanLeano @ChrisTuck_WWHF @RachelintheOC @jcstaff_ @DrAndyMayers @CestriaTherapy @Frenchhen74 @HayleyMcGregor1 @Sunnyclaribel How exactly are we defining what constitutes a hobby here? #CSAQT", "I find non meditation mindfulness works for me. Putting things into perspective. A bad minute doesn't need to lead to bad day  #CSAQT", "RT @StevenJPayton: We are getting into our last 10 mins of tonights #csaqt chat\nSo is there one thing, one hobby you would like to try? and…", "@CSAQT I think there's something very grounding about engaging senses, touch, visuals and even the smell of yarn, I like to use sheepy wools. #csaqt", "RT @myworldmywords: @kykaree That people still have that prejudice that victims go onto be perps, even though statistically isn't the case.…", "This.... #CSAQT https://t.co/LIyrgbnQ1Z", "RT @CounsellingKaz: any suggestions #csaqt tweeps https://t.co/OsAtqkozRz", "@Luciek11K @CounsellingKaz Hope it comes back soon, as I have a stack of books to read!! #csaqt", "Thanks to everyone who joined us tonight, to @shinybluedress for retweeting chat and @CounsellingKaz for facilitating\n#csaqt", "At the moment knitting is a favourite hobby of mine  #csaqt", "I love celebrating the seasons with crafts like these eggs  #CSAQT https://t.co/rSL5wBPVWX", "@Frenchhen74 @CSAQT @CounsellingKaz I struggle with this so much, especially with my work. Which is a problem as my work is pretty much always going to be criticised in some way! #csaqt", "So part of being able to bounce back is accepting that perfection isnt possible, and thats OK, days do not have to be all good, to be good #CSAQT", "RT @StevenJPayton: @CSAQT @PookyH often tweets 3 good things. Asks us to think of  3 good things that have happeed that day:)\n#csaqt", "RT @Frenchhen74: @CounsellingKaz Hi Karen, I hope you’re well! #csaqt", "I love playing Pokemon go. I had severe panic attacks following my break down and my then 6 year old son suggested I play so I was concentrating on little creatures and not scary humans  #CSAQT", "@green_pagan Hi Kirsty. great to see you here #CSAQT", "RT @kykaree: Hobbies aren't just part of my recovery they were integral to my survival. Being able to absorb oneself in something that you…", "@lilgrace2911 And if it goes wrong wtf if I'm going to be fkd up I may as well go the whole hog #csaqt turns out we have already been through the worst....nothing can ever be that bad again", "@green_pagan that does sound hard, it feels like it would be so hard to put the effort into anything #CSAQT", "Tonights chat is about our hobbies.\nWhat do we like to do in our down time?\nhow do they help us?\n#csaqt", "I do need alone time when I am hurting and listen to some @emilieautumn #csaqt to make things better.", "@Frenchhen74 @CounsellingKaz I probably go over the top with it now in an attempt to over compensate that #csaqt", "RT @cmwolfy12: @CounsellingKaz My mantra at the mo trying to get it hardwired. If I keep saying it I might believe it 😉 #csaqt", "@green_pagan hi Kristy great you could make it! #CSAQT", "RT @lilgrace2911: @CounsellingKaz I get it in theory. But in practise...#csaqt", "RT @cmwolfy12: @lilgrace2911 Hey I resonate with so much of what u day and it helps me a lot don’t be sorry #csaqt", "It’s so easy just to give in but then I’m filled with regret and disappointment #CSAQT", "RT @lilgrace2911: @CounsellingKaz @Frenchhen74 @StevenJPayton I just don’t feel it’s fair. People come here for support and I never seem to…", "Maybe this could be a twitter thing? The aim could be to tweet one thing &amp; a photo each day of something you’ve done that’s good/pleasant etc\n\nThere could be a hashtag like #100GoodThings Day 1 etc\n\n#CSAQT https://t.co/85km8YgqSZ", "@CounsellingKaz @Frenchhen74 All or nothing thinking is the enemy! #csaqt", "having plans for when you are feeling low can really help, put them in place when things are OK, sometimes keeping a list of things that make you feel better can be a huge help #CSAQT", "@CounsellingKaz My mantra at the mo trying to get it hardwired. If I keep saying it I might believe it 😉 #csaqt", "RT @johnharvey1976: Puppy therapy is a great idea if you are feeling blue and need a pick me up. #csaqt", "@Luciek11K reading can just be wonderful, its part of my bedtime wind down routine too #CSAQT", "@Frenchhen74 @lilgrace2911 @StevenJPayton We are all at different parts of our journey. #csaqt", "@CounsellingKaz @Luciek11K I find I go through stages when I can’t read at all.... I’m in one of those at the moment, my head is too stuffed up with other thoughts. #csaqt", "RT @CounsellingKaz: @lilgrace2911 theory has to come before practice tho, its a vital step #CSAQT", "@lilgrace2911 You arnt 'inflicting' anything on anybody\nWe al value your thoughts\n#csaqt", "How to hurt your child in one easy lesson.\n#csaqt https://t.co/JjzKdZHoNG", "@CSAQT I love the feel of the wool and use vibrant colours it really helps #csaqt", "@Frenchhen74 Hi Hen! welcome to chat #CSAQT", "Goodnight #CSAQT", "@kykaree Pyrography is therapeutic. Those moments when self harming thoughts arise just burn the shit out of a piece of wood #CSAQT", "RT @StevenJPayton: @lilgrace2911 look after your self Lucy\n#csaqt", "@kykaree Can you tell us a bit about you hobbies?\n#csaqt", "RT @CounsellingKaz: @Frenchhen74 @lilgrace2911 @StevenJPayton and you both are such valued tweeters, and your honesty will help many silent…", "@Eloc42617770 @CSAQT @btcc_crazy He's much better than me I just like to burn wood in the polite sense of the word #CSAQT", "Now just 99c for the next 2 days at https://t.co/dTyBws4gKO !!  4.5* Some review highlights:\n\"highly recommend\"\n\"could not put it down\"\n\"An effective and powerful tool for sexual abuse survivors, overcomers, and those yet to be freed.\"\nplease RT #csa #csaqt #memoir https://t.co/iHIhpafy3U", "@kykaree thanks for sharing such great ideas #CSAQT", "RT @kykaree: When I was having therapy I drew a lot of pictures like my safe place in my mind and others to help release my inner child. I…", "RT @StevenJPayton: @kykaree @CounsellingKaz Your contribution are important. I was trying to say that perhaps being too positive can be a p…", "RT @StevenJPayton: @Frenchhen74 Hi Hen :)\n#csaqt", "RT @StevenJPayton: no matter if you feel OK to join in the chat, or just watch from the sidelines remember you are always welcome to #csaqt", "RT @CounsellingKaz: tonights #csaqt is on hobbies and things that make us happy, as well as help us when things are tough. Starts at 8pm UK…", "@kykaree Beautiful Kylie, totally awesome #csaqt", "RT @shinybluedress: @carynwalker4 Hey! Welcome to our chat! I’m dipping between this account and @CSAQT until 9pm but follow the comments u…", "@CuriousQualia @StevenJPayton it sounds like it is a very absorbing hobby #csaqt", "@kykaree What way does it help you Kylie? #csaqt", "RT @kykaree: @CounsellingKaz @Frenchhen74 All or nothing thinking is the enemy! #csaqt", "Whatever we are doing we are trying our best with what we have been through and we can go on to succeed in whatever we need to do because we are worthy #csaqt", "RT @myworldmywords: @johnharvey1976 Truly beautiful @johnharvey1976 you have serious talent #CSAQT", "We are getting into the last 10 mins of tonights Chat.\nSo is there something, a thought maybe, that you can go to to start pulling your self out of a bad day?\n#csaqt", "@kykaree I’d have to wear my glasses 👓 now 😟 #csaqt", "sometimes we all need time out, and hobbies can be an incredible way of providing that space #CSAQT", "Hobbies aren't just part of my recovery they were integral to my survival. Being able to absorb oneself in something that you choose to do can be really powerful  #csaqt", "RT @green_pagan: @CSAQT #CSAQT photography. This one was done by @btcc_crazy https://t.co/wbO6q6qyLl", "I think out hobbies are deeper than just a technique we use.\nDo others feel their hobbies show a deeper side of themselves?\n#csaqt", "RT @myworldmywords: @shinybluedress Stunning views sue #csaqt", "RT @CSAQT: Join in tonight at #CSAQT https://t.co/BdFbgfBpBa", "After the loss of Chester Bennington I felt deep emotional pain so I knitted two shawls, made from yarns named after Linkin Park songs. They give me comfort and strength  #CSAQT https://t.co/9O8GiyFAch", "@kykaree @CounsellingKaz This one cheers me up! #csaqt https://t.co/MSJSEU7Jxb", "Love these colours Kylie.\nSue x\n#CSAQT https://t.co/yBdP5zo3gZ", "RT @StevenJPayton: @lilgrace2911 Hi Lucy\nStay strong and look after your self\n#csaqt", "getting away from the binary thinking of good versus bad days oddly is a huge way to have better days #CSAQT", "@StevenJPayton 1/2 I am an anxious overthinker &amp; find that genealogy/family research puts my analysing mind to good use. It is the only positive thing I can mentally concentrate on that shuts out other negative intrusive thoughts that I don't always feel ready to deal with #csaqt", "I think it is important on a bad day to connect with something that make know you are not alone. That is why I love music so I can one hear the words of just how I feel and hearing someone else speaking them. Knowing someone having the same feeling is great. #csaqt", "RT @johnharvey1976: I can be really good at dodging things or people that will upset me.  I am not sure if it is in my head but it seems I…", "How do your hobbies/pastimes help you cope? Join us in an hour at this twitterchat.\nDon’t forget to use the hashtag #CSAQT ( see @CSAQT ) https://t.co/skW9vcdFQi", "RT @shinybluedress: Join @CounsellingKaz and @StevenJPayton for this weeks twitterchat at #CSAQT https://t.co/Kv6HwrtlNa", "Learning not to blame yourself for feeling low is hugely important too, its OK to have a bad day, it doesnt make you weak or a bad survivour #CSAQT", "RT @lilgrace2911: @CounsellingKaz Like, right now I’m battling my urges to self sabotage because I feel like if I’m less than perfect every…", "RT @johnharvey1976: I love writing and it is a cool way to get some of my feelings out. Not all of my feeling is from the abuse and just ni…", "RT @CSAQT: Music is very therapeutic #csaqt https://t.co/xktm2vPkKV", "RT @CounsellingKaz: @MJCounselling beautiful! #CSAQT", "RT @kykaree: @StevenJPayton @CounsellingKaz In a really deep and meaningful way rather than just glib platitudes like 'it will pass' you mi…", "RT @CSAQT: Thank you so much everyone for joining in, it’s been good to get to hear about the things you enjoy doing in spare time.\nNever e…", "RT @CounsellingKaz: @johnharvey1976 good evening John. very well here. had a great run today. how about you? #CSAQT", "RT @lilgrace2911: So, how do I prevent myself from self sabotaging? I can now recognise that I’m doing it, but how the heck do I stop??!!#c…", "@StevenJPayton @CSAQT Or as my partner calls it, campfishing...i guess it's more camping than fishing cause we sit or sleep more than we catch over 3-5nights #csaqt", "I’m not being very good about getting out &amp; doing new stuff at the moment. Just clinging to what I know. #CSAQT", "@CounsellingKaz @green_pagan Yes I can relate to that. I feel uncomfortable if someone says I’ve done something well... I feel they must be saying it to be nice to me. #csaqt", "RT @green_pagan: #csaqt I feel I'm probably a little warped but an \"early night\" is my go to", "#csaqt thankyou as always guys. Take great care of yourselves", "@kykaree @Luciek11K @Frenchhen74 @CounsellingKaz I find reading difficult at best of times, I guess in part from never really forming the skills or love to read as a small child and in part I'm really lazy and do things in small chunks #csaqt", "RT @StevenJPayton: @green_pagan Hi Kirsty\n#csaqt", "RT @CounsellingKaz: Good evening everyone hobbies can be so important, there can be a belief that we \"should\" be working on our past at eve…", "@cmwolfy12 a wonderful final thought #CSAQT", "Join us for the last half hour at #CSAQT https://t.co/g4s4g05rdo", "@green_pagan Now you have intrigued me :)\n#csaqt", "tonights #csaqt is on hobbies and things that make us happy, as well as help us when things are tough. Starts at 8pm UK timw", "@Frenchhen74 @CounsellingKaz Do any of you guys fuck up on purpose? #csaqt", "I relate to the perfectionism I’ve had some negative feedback on my academic work which I spent ages on took days recovering from that although was constructive #CSAQT", "RT @CSAQT: What a great idea. Who else does this? #csaqt https://t.co/71pSuKhN9a", "@CestriaTherapy @CounsellingKaz Whether watching from a safe distance or actively participating you are a part of the #csaqt family and always welcome https://t.co/19bT0RFJVA", "RT @CounsellingKaz: @green_pagan Thanks for joining us Kirsty #CSAQT", "I'm feeling guilty for being too positive, sometimes you just can't win  #CSAQT", "RT @johnharvey1976: I think it is important on a bad day to connect with something that make know you are not alone. That is why I love mus…", "RT @myworldmywords: @StevenJPayton @CSAQT Or as my partner calls it, campfishing...i guess it's more camping than fishing cause we sit or s…", "@CounsellingKaz @StevenJPayton Everyone has them #csaqt", "RT @CounsellingKaz: getting away from the binary thinking of good versus bad days oddly is a huge way to have better days #CSAQT", "Today TwitterChats\nCent European Time\n9PM #EngChatUK #ContentChat #CommsChat #WealChat #CSAQT", "@myworldmywords it totally does! connecting with nature should be part of mindfulness #CSAQT", "RT @beam_project: ANNOUNCING.. a workshop for all safeguarding practitioners, delivered by survivors of child sexual abuse: Please join us…", "RT @lilgrace2911: @CounsellingKaz True. I guess. #csaqt", "Twitterchat topic for CSA/CSE survivors on Mon April 23 at #CSAQT 8-9pm UK🇬🇧 \n(see @CSAQT ) https://t.co/FmHBWlNxJO", "Bye guys. Take care #CSAQT", "Hi everyone, sorry I'm late. Lots of follow ups this evening. I hope everyone is ok #csaqt", "@CSAQT Hi Sue! Hope you are well🐱 #csaqt", "RT @7107Lilly: @StrongWalkAlone @green_pagan @kykaree @CSAQT Oh, I am so sorry that you're beautiful childhood art efforts were rejected. P…", "RT @myworldmywords: And take these beautiful creatures with me #CSAQT https://t.co/KpY2uIeMWo", "@shinybluedress Stunning views sue #csaqt", "@StevenJPayton 2/2 I think it is linked to my CSA in a way because I like to find answers/solve problems. I was a confused child due to CSA &amp; it has resulted in my analysing mind. Genealogy is my outlet I guess. It is nice to piece things together which I can't do with my own problems #csaqt", "@johnharvey1976 good evening John. very well here. had a great run today. how about you? #CSAQT", "@CSAQT Hello everyone! So glad to have made it! 🐱 #csaqt", "RT @cmwolfy12: I do cook as a way of relaxing  #CSAQT", "@Frenchhen74 @lilgrace2911 It gets harder before it gets better. To quote @shinybluedress its like picking a scab and squeezing the wound #csaqt", "@green_pagan You’ll have to show me #csaqt", "What a great idea. Who else does this? #csaqt https://t.co/71pSuKhN9a", "https://t.co/PoGNmHQqcL a post on self care and rewarding ourselves #CSAQT", "RT @StevenJPayton: @lilgrace2911 Dont be sorry for looking after your self\nTake care #csaqt", "@myworldmywords @kykaree its a completely unfounded prejudice but sadly most stigma is #CSAQT", "RT @CounsellingKaz: @green_pagan @Frenchhen74 self sabotage can be a huge issue, it often relates to feeling we dont deserve good things, o…", "RT @cmwolfy12: @Frenchhen74 @green_pagan @CounsellingKaz Yeah I get this Hen... I feel I am not deserving or I’m unable to finish this degr…", "RT @StevenJPayton: Twitterchat topic for CSA/CSE survivors this evening at #CSAQT 8-9pm UK🇬🇧 \n(see @CSAQT ) https://t.co/DmlTaLJjic", "@green_pagan @Frenchhen74 @CounsellingKaz Sometimes there is the feeling that \"everything has gone to **** so i might as well finish it off\"\n#csaqt", "So I am just going to have to admit it.\nI like model railways. It’s taken over one of the bedrooms....\n#csaqt https://t.co/sMfe7ksant", "RT @kykaree: @CSAQT Yes they're mine, made from plastic beads. #csaqt", "RT @CounsellingKaz: @kykaree yes! for me thats the take home point of today \n#CSAQT", "@CounsellingKaz Probably am. But I keep trying not to be. #csaqt", "Puppy therapy is a great idea if you are feeling blue and need a pick me up. #csaqt"]