["@starttotalkuk What I've done 4 the past few years is 'comfort watch' certain shows before bed. This actually works! It really distracts me, so when my meds kick in, my mind is clear from the bad memories. And I don't have bad nightmares due to doing this. #CSAQT", "RT @Wolfg46611072: @StevenJPayton I guess my ability to relax is impaired #csaqt\n\n also my ability to start working you know sit down at de…", "RT @StevenJPayton: @natasha367b @emsurvivors @CSAQT I was going to ask about that, I haven heard of OSDD before :)\n#csaqt", "RT @2_fleurdelis: @melbcat1 Mine as well. Night terrors have become daily early morning events for me. Hyperarousal starts up right before…", "@LadyAnnatar @natasha367b @StevenJPayton QT = question time \nMasking in this case means suppressing symptoms or behaviors solely to \"fit in\" socially, not because they're harming anyone. #CSAQT", "@badbrainAJ @CSAQT Hi Andrew\nWelcome to #CSAQT chat.\nDoctors do seem reluctant to prescribe them. Did they have any lasting effect or has the problem returned?", "@starttotalkuk I keep on telling myself this 2 ease the guilt, which most times works. All I can do is compensate by making a greater future 4 myself. I'm just glad I can actually sleep at night. Not having fear b4 bed has really eased my depression, hence my life is much better than b4 #csaqt", "I’ve always told myself things will get better but 🤷‍♀️ doesn’t feel like it ever will #csaqt", "@StevenJPayton @natasha367b @starttotalkuk Awww they are so cute 💜. The perfect lifelong friends 😊 #csaqt", "RT @melbcat1: I have terrible problems trying to get to sleep and staying asleep. I have tried sounds, music, relaxation and mindfulness te…", "@2_fleurdelis @turtles4netty Maybe its just not having the 'normal' bed that the abuse happened in?\nSo we try to change something?\n#csaqt", "@starttotalkuk Another thing that helps me sleep ok, is having my dream team with me. Think it's coz I was never allowed to sleep with teddies as a kid. When I sleep at friends they have to come with me or I won't sleep. Bruce, Chuckles &amp; Martha #csaqt https://t.co/CzzOyPiQCQ", "@starttotalkuk @Sh3llieeeeee @natasha367b Always. #csaqt", "@starttotalkuk Yeah, you can either be too distrustful or end up trusting the wrong ones when you've encountered abuse as a child. It's a massive learning curve isn't it. #csaqt", "RT @turtles4netty: Right now I’m getting in a tiz cos I have to go to work night shift..  I’m tired and just generally not good with them 😢…", "RT @smile4wales: @StevenJPayton Yes! I use audio books at night time it stops me getting creeped out by every little noise. I haven't heard…", "@turtles4netty We have to hold on to that belief though :)\n#csaqt", "RT @StevenJPayton: To everybody, those that feel able to join in the chat and those fellow travelers watching, welcome to #CSAQT tonight, H…", "@StevenJPayton @starttotalkuk Will &amp; Grace, Charmed, Only Fools &amp; Horses or Friends. They are shows that I can totally escape into. Can't watch Horror films after 9pm, as I have bad nightmares that contain parts of my abuse #CSAQT", "RT @Willow_B_Well: @StevenJPayton I do take a preventive meds but still get breakthrough headaches, especially when emotionally stressed or…", "RT @Wolfg46611072: @StevenJPayton The thought of sitting down for work creates weird and huge emotional stress ...same stress l felt as a t…", "@StevenJPayton Yes! I use audio books at night time it stops me getting creeped out by every little noise. I haven't heard the endings of any of them tho😂#csaqt", "RT @Sh3llieeeeee: @starttotalkuk Another thing that helps me sleep ok, is having my dream team with me. Think it's coz I was never allowed…", "@StevenJPayton @shinybluedress Okay, I qualify. I was not sure if it was about general child abuse or something more specific. I suspect that my early insomnia was dierctly connected to early childhood sexual abuse that started, I think, when I was 4. I won't go into the détails. #CSAQT", "RT @StevenJPayton: Welcome to tonights chat :)\n#csaqt https://t.co/iawScexKkE", "@starttotalkuk was such a relief when I 1st got prescribed them.Jan 6th 2010 was the 1st time in my life that I was able 2 go 2 sleep without forcing myself 2 sleep. &amp; it was the 1st time I never had any bad dreams.I woke up refreshed instead of traumatised.I'll always remember this date #csaqt", "RT @NotesOfKate: My first blog post is up! 'Socially acceptable' signs of abuse, the over compliant and over committed child. https://t.co/…", "@turtles4netty @2_fleurdelis Maybe we have discovered something here :)\n#csaqt", "@Willow_B_Well @StevenJPayton OH, I think you mean High Definition! LOL!  In the 60s, I lived in USA then, we uysed to talk about dreams in technicolor.  #CSAQT", "@lilgrace2911 @StevenJPayton @CSAQT Self-care is important, hope things ease up for you. #CSAQT", "Tonight we are talking about the every day, day in day out impact on us of non recent abuse.\nHow does it impact our daily life?\n#csaqt", "@StevenJPayton @Willow_B_Well @2_fleurdelis Like BEDS!!!!! #CSAQT 🧛🏻‍♂️🛌🏼😨", "RT @Sh3llieeeeee: @starttotalkuk Yeah, they most certainly soothe me. I live on my own, so my inner child sees them as security guards. Who…", "Hi #csaqt relate to alot of things being said. Have had alot of gynie probs. My pains get worse b4 my period. My body gets so tense n headaches n it gets harder to control the bad thots.\n\nDoes any1 do this over controlling, over censoring everything you do?", "RT @Willow_B_Well: Up around 3 AM this morning. In a bout of #insomnia. Comes and goes, depending on triggers. #CSAQT https://t.co/MEal1wd2…", "RT @StevenJPayton: As we get into the last minutes of tonight's chat is there one thing that you would advise somebody to try if they are h…", "RT @StevenJPayton: @neverendingly Hi Naomi\nWelcome to tonights chat\n#csaqt", "An interesting article that might be of interest as it is on the same subject as our topic Monday\nhttps://t.co/VgwhqRfAud\n''Work and how it impacts survivors'\nJoin us 8pm-9pm UK  using the tag #CSAQT for this twitter chat (See @CSAQT) https://t.co/vtGX6PeTDm", "RT @StevenJPayton: @Wolfg46611072 Have you found anything that helps?\n#csaqt", "RT @neverendingly: Hi #csaqt relate to alot of things being said. Have had alot of gynie probs. My pains get worse b4 my period. My body ge…", "@StevenJPayton I find it hard to switch that alertness off. It can be exhausting #CSAQT", "@starttotalkuk I feel like sleeping right about now, but then I would wake up around midnight and be awake all night. 😩#CSAQT", "RT @turtles4netty: Some of the things that impact me everyday include, “trust” or lack of, social anxiety, insomnia, sometimes I just don’t…", "@StevenJPayton @smile4wales Hi. Sometimes I look for binaural beats on You Tube when my mind is racing too much to sleep. It helps some, depending on what's disturbing my sleep. #csaqt", "RT @StevenJPayton: Next Monday's 6th May #CSAQT Twitter chat for adult survivors of Child Abuse will be on the topic of Work\nHas the abuse…", "RT @StevenJPayton: As we come to the end of tonight's chat Thank you EVERYBODY, Tweeters &amp; Fellow travelers alike for joining us @ #CSAQT t…", "@StevenJPayton I'll try to remember to use the #csaqt each time.", "@StevenJPayton @emsurvivors @CSAQT https://t.co/ERdrKQmCzd  I don't lose time which is part of #DID (Dissociative Identity Disorder, previously called Multiple Pesoanlity Disorder), I have \"parts\" of \"alters\" which is Type B. #CSAQT", "@StevenJPayton The positves are I know I am strong, survived and met some great people along the way💕 negatives are it being stuck there in my mind every day. #CSAQT", "@StevenJPayton @turtles4netty I forgot about that. I remember doing that as a child, it did help. #csaqt", "Join our twitterchat conversation at #CSAQT https://t.co/ZjGjEulZh7", "RT @neverendingly: #csaqt I can swing from not trusting at all to putting all my faith in someone, or over sharing n scaring ppl.\n\nI can go…", "@starttotalkuk You'd think in this day and age that society would understand the complexity of #CSA. The lack of awareness &amp; how we're made 2 feel about our trauma only fuels our #PTSD. Hence why most of us live in a time loop; reliving our pain. Things have to change, and soon #csaqt", "@starttotalkuk Suppose it's down to be around the wrong sort of people. The last few years I've cut these types from my life/won't make friends with those that judge others. I'd rather have a small healthy circle of friends, which sees me more happier than in previous years #csaqt", "@StevenJPayton @smile4wales hi all #csaqt", "@StevenJPayton @turtles4netty The second thing you mentioned works for me sometimes. Getting up, doing something like washing my face, reading, writing, or petting the cats awhile will give me a second chance to go to bed and fall asleep. #csaqt", "@Willow_B_Well Can you control the headaches in an way Willow?\n#csaqt", "RT @turtles4netty: Gonna try and catch some of this but got to get ready for night shift too😕 #CSAQT", "Up around 3 AM this morning. In a bout of #insomnia. Comes and goes, depending on triggers. #CSAQT https://t.co/MEal1wd2Oq", "RT @StevenJPayton: @turtles4netty Hi netty\ngood to see you :)\n#csaqt", "@lilgrace2911 @CSAQT Make sure you look after yourself\n#csaqt", "@starttotalkuk It really damaged me not able 2 sleep proper. It put yrs on me. I couldnt function in the day &amp; I was always stressed. If Im honest, it hindered me as a parent, which I feel guilty about. I cant get them yes bk, hence why I try even harder 2 make a good life 4 me &amp; my fam #csaqt", "RT @2_fleurdelis: @StevenJPayton Me too. But inverse true for me as well, some days. Doing something novel or social on days off helps, whi…", "RT @StevenJPayton: @2_fleurdelis being alone I can well understand.\nOne of the reasons I find work helpful and weekends so bad\n#csaqt", "RT @NotesOfKate: @Sh3llieeeeee @StevenJPayton @starttotalkuk I also really struggle with horror/scary films and tv. It sends my hypervigila…", "RT @lilgrace2911: @StevenJPayton @CSAQT Massively. #csaqt", "@smile4wales But have you found anything that helps you switch off from it mall?\n#csaqt", "Some of the things that impact me everyday include, “trust” or lack of, social anxiety, insomnia, sometimes I just don’t wana wear a smile and pretend :/  #CSAQT", "Tonight's #CSAQT brought to U by the letter C Coping\n'Every day impact on survivors of abuse' \nsuch as Difficulties in sleeping, concentrating or relaxing \nInteracting with others socially or at work What do we experience? &amp; how can we help ourselves?\n#CSAQT https://t.co/Fc2GqU5pdl", "The transcript of last nights #CSAQT twitter chat on the topic of the Day to Day impact of Non-recent Child Abuse  is now available\n\nhttps://t.co/1TDUsyxeKz", "@starttotalkuk I couldnt have worded it better! The cycle of abuse can b never ending &amp; its only when we break the cycle by means of understanding/healing/self-💜 etc. But 2 break it we need outside help I.e therapy etc, which should b offered 2 all victims. 4 most, we ave 2 fight 4 help #csaqt", "As we come to the end of tonight's chat Thank you EVERYBODY, Tweeters &amp; Fellow travelers alike for joining us @ #CSAQT tonight\nPlease practice good self care today everyone. Chat can be triggering even hours afterward. #csaqt", "RT @Willow_B_Well: @natasha367b @StevenJPayton I did that as well. I remember my first night in a regular bed, just before I turned three,…", "RT @Willow_B_Well: The word 'axe' is sounded in relax, so if I'm noticing that, it isn't easy. \n[TW: abuse mentioned]\n\nPlus, I was abused a…", "When we feel forced to mask our #trauma, our #neurodiversity, etc. it only compounds factors contributing to #CPTSD/#PTSD, #dissociation, social anxiety, isolation and depression. \n\n#CSAQT #ActuallyAutistic https://t.co/jOQaCFjDHp", "@StevenJPayton What does CSAQT stand for? I am an abuse survivor in Canada. #csaqt", "@lilgrace2911 @CSAQT Hi Lucy Welcome to tonights chat :)\n#csaqt", "RT @natasha367b: @Willow_B_Well @StevenJPayton OH, I think you mean High Definition! LOL!  In the 60s, I lived in USA then, we uysed to tal…", "RT @NotesOfKate: @smile4wales @StevenJPayton I find it's always in my mind too Lucy, not always at the front but there everyday #csaqt", "RT @NotesOfKate: @StevenJPayton @turtles4netty I struggled with insomnia when I was in counselling. A few things that (sometimes) helped me…", "RT @StevenJPayton: TRIGGER WARNING: Today's chat discusses abuse. Please practice excellent self-care\nIF you're in the US you can reach out…", "RT @StevenJPayton: The transcript of last nights #CSAQT twitter chat on the topic of the Day to Day impact of Non-recent Child Abuse  is no…", "@StevenJPayton @starttotalkuk I totally get that. It's a good definition 👏🏼 #CSAQT", "@2_fleurdelis @starttotalkuk Escapism is the key, Denise. Watch/do something that's so far away from what you've experienced. It took me decades to figure this out. #csaqt", "RT @StevenJPayton: @Wolfg46611072 welcome to tonights #csaqt chat", "@starttotalkuk Thank you for that reminder 💜. As my therapist said, \"You're not to blame yourself for the bad stuff that's happened to you/how its affected you. But what you can do is your best to overcome it/survive the best way you can\". #csaqt", "RT @lilgrace2911: @StevenJPayton @CSAQT Thanks. I’m not really in a very good place so I’m not going to stick around. #csaqt", "@Sh3llieeeeee @StevenJPayton @starttotalkuk I also really struggle with horror/scary films and tv. It sends my hypervigilance into overdrive. Does anyone else find this? #csaqt", "RT @Willow_B_Well: I'm fairly sure my headaches are related to my abuse history because I get them when triggered, dissociate &amp; switch. Plu…", "TRIGGER WARNING: Today's chat discusses abuse. Please practice excellent self-care\nIF you're in the US you can reach out to RAINN at 1.800.656.HOPE\nIf you are in the UK you email the Samaritans at Jo@Samaritans.org\nor call them on 116 123 (UK)\n116 123 (ROI)\n#csaqt", "@2_fleurdelis @Willow_B_Well One of the problems, particularly when the abuse happened in the home, is that places most people think of as safe / comforting can be the opposite for survivors\n#csaqt", "RT @StevenJPayton: @turtles4netty We have to hold on to that belief though :)\n#csaqt", "RT @natasha367b: @StevenJPayton #CSAQT It,s like there's a switch in my brain that Ij ust can't turn off. Once in awhile I will tell myself…", "RT @StevenJPayton: @2_fleurdelis @smile4wales Hi denise\nwelcome to chat tonight\n#csaqt", "RT @CSAQT: Join our twitterchat conversation at #CSAQT https://t.co/ZjGjEulZh7", "RT @2_fleurdelis: @StevenJPayton @turtles4netty I forgot about that. I remember doing that as a child, it did help. #csaqt", "@Willow_B_Well @starttotalkuk As they say, \"laughter is the best medicine\". 4 me, having a good laugh at anytime kills off any emotional pain. So I thought one night \"let's binge on a show that cracks me up b4 bed &amp; see what happens\" &amp; believe it or not, I went to bed with no fear &amp; I slept like a baby #csaqt", "RT @Wolfg46611072: @StevenJPayton Deadline so work as a last minute motivation ... So, l have become a last minute deadline writer #csaqt", "RT @Sh3llieeeeee: @starttotalkuk What I've done 4 the past few years is 'comfort watch' certain shows before bed. This actually works! It r…", "RT @StevenJPayton: Some of us have already mentioned difficulties in social / work interactions.\nIs this something that impacts the rest of…", "RT @NotesOfKate: @starttotalkuk I find that feeling of fear is very triggering, I think my brain struggles to distinguish between real dang…", "RT @natasha367b: @Willow_B_Well I used to get that; I'd go from sleeping &amp; dreaming to being on my feet in a state of terror is a couple of…", "RT @StevenJPayton: On impact that survivors often report is difficulties in getting to sleep.\nThis is a known problem associated with PTSD…", "@StevenJPayton The thought of sitting down for work creates weird and huge emotional stress ...same stress l felt as a teen when l stopped doing work for school #csaqt but now once l have sat down is sort of ok", "RT @natasha367b: @StevenJPayton I'll try to remember to use the #csaqt each time.", "@turtles4netty Have you found any way to switch it off, or even reduce its impact?\n#csaqt", "RT @StevenJPayton: Hi Kate. Welcome to chat\nHyper vigilance is another common problem for survivors.\n#csaqt https://t.co/dGANMDRxfJ", "RT @Sh3llieeeeee: @StevenJPayton @starttotalkuk Will &amp; Grace, Charmed, Only Fools &amp; Horses or Friends. They are shows that I can totally es…", "I have terrible problems trying to get to sleep and staying asleep. I have tried sounds, music, relaxation and mindfulness techniques none have helped! I am permanently shattered #CSAQT", "@StevenJPayton It can be both tbh.. but mostly waking in the night and can’t get back off to sleep... my mind goes into overdrive and replays every shitty moment that has happened during the day 🙁#csaqt", "@starttotalkuk I've been told that I'm weird 4 sleeping with teddies a few times. That a 45yr old should be past all this. People have in fact distanced themselves from me cuz they find it weird. But they haven't got to deal with what's in my mind. It's nice to be understood 4 once #csaqt", "RT @2_fleurdelis: @Willow_B_Well @StevenJPayton Can relate. Trying to make bed, and bedrooms, safe welcoming places is complicated. #csaqt", "RT @Sh3llieeeeee: @StevenJPayton @starttotalkuk I totally get that. It's a good definition 👏🏼 #CSAQT", "@StevenJPayton It's really only this barrier to start working .... Ever since l'm 10 never left me ....#CSAQT", "@StevenJPayton I have intrusive thoughts for long periods of time lately. Sometimes it seems I spend most of the day managing them. New surroundings, supportive people, and interesting things to do help. Day to day activities, mundane tasks, and being alone are triggers now. #csaqt", "RT @StevenJPayton: @NotesOfKate @smile4wales I have a app on my phone that will play rain and other nature sounds. It has a timer so will t…", "@StevenJPayton @turtles4netty Sometimes exerting just the smallest bit of control maybe helps remind that the abuse isn't happening now. #csaqt", "@NBturtlebattle @smile4wales Hello and welcome :)\n#csaqt", "@Sh3llieeeeee @starttotalkuk Something I sometimes refer to as 'Tonights episode of Nightmare Alley' :)\n#csaqt", "RT @2_fleurdelis: @StevenJPayton @turtles4netty The second thing you mentioned works for me sometimes. Getting up, doing something like was…", "@starttotalkuk I totally get that. It's like a time loop; stuck in that time when it happened. When it gets darks the time loop starts, over and over again. B4 meds, I had to have a couple of joints to knock me out. But then my nightmares would kick start the time loop. #CSAQT", "RT @StevenJPayton: @Willow_B_Well Hi Willow\nWelcome to tonights chat, hope you are feeling a bit better now\n#csaqt", "RT @StevenJPayton: @natasha367b Hi Natasha\nit Child Sex Abuse Question Time\nA twitter chat for survivors started by @shinybluedress \n#CSAQT", "Some of us have already mentioned difficulties in social / work interactions.\nIs this something that impacts the rest of us?\n#csaqt", "RT @turtles4netty: I’ve always told myself things will get better but 🤷‍♀️ doesn’t feel like it ever will #csaqt", "@2_fleurdelis being alone I can well understand.\nOne of the reasons I find work helpful and weekends so bad\n#csaqt", "RT @smile4wales: @StevenJPayton There isn't a day I don't think about it. Not always negatively but, every day.  Going out of the house is…", "@Sh3llieeeeee @starttotalkuk We watch comfort shows, too. Mostly comedy or classics anywhere near bedtime. #CSAQT", "@StevenJPayton I guess my ability to relax is impaired #csaqt\n\n also my ability to start working you know sit down at desk ... For the beginning of it mostly .. can take hours", "RT @StevenJPayton: Tonight we are talking about the every day, day in day out impact on us of non recent abuse.\nHow does it impact our dail…", "@starttotalkuk I just hope I live to see the day when #CSA is seen as an issue and not a burden. I doubt it'll ever happen, but I'll keep on hoping 🙏🏼 #CSAQT", "RT @Sh3llieeeeee: @starttotalkuk It really damaged me not able 2 sleep proper. It put yrs on me. I couldnt function in the day &amp; I was alwa…", "RT @Willow_B_Well: @smile4wales @StevenJPayton If I can get out in nature that does help so much. Otherwise, I rely on sound to deal with h…", "Helpful #CSAQT chat today--thanks everyone! Now off to rest a bit before dinner. Have a good night!", "@StevenJPayton @CSAQT Massively. #csaqt", "As we get into the last minutes of tonight's chat is there one thing that you would advise somebody to try if they are having difficulties in relaxing, switching off or getting to sleep\n#csaqt", "RT @Sh3llieeeeee: @starttotalkuk I totally get that. It's like a time loop; stuck in that time when it happened. When it gets darks the tim…", "@smile4wales You say the thoughts are not always negative, but always there?\n#csaqt", "To everybody, those that feel able to join in the chat and those fellow travelers watching, welcome to #CSAQT tonight, Hail &amp; well met.\nTo join in the chat just add #CSAQT to your tweet", "Please join us 8pm - 9pm UK Monday 29th using the tag #CSAQT \n'Every day impact on survivors of child abuse'\nsuch as\nDifficulties in sleeping, concentrating or relaxing\nInteracting with others socially or at work\n\nWhat do we experience? &amp; how can we help ourselves? https://t.co/5FkyGIeft6", "@StevenJPayton @turtles4netty I moved the bed out of the bedroom and sleep in the front room now! Helped for awhile. #csaqt", "@StevenJPayton @2_fleurdelis So very true! #CSAQT", "RT @Sh3llieeeeee: @starttotalkuk Very true. They can be traumatising, that much so I was scared to go to sleep. I always felt like I were t…", "RT @StevenJPayton: @smile4wales Hi Lucy\nWelcome to chat tonight :)\n#csaqt", "Welcome to tonights chat :)\n#csaqt https://t.co/iawScexKkE", "@starttotalkuk I find that feeling of fear is very triggering, I think my brain struggles to distinguish between real danger (like the abuse) and when there is no actual threat (a tv show) #csaqt", "Part of my problem with sleep is that due to the horrendous nightmares and flashbacks I get I don’t want to go to sleep so there is a barrier there even before I do concede and try #CSAQT", "RT @StevenJPayton: @turtles4netty Have you found any way to switch it off, or even reduce its impact?\n#csaqt", "@StevenJPayton @smile4wales Yes, me too. Gotta go now but I'll try to join you next week or whenever the next QT is. #CSAQT", "RT @melbcat1: Part of my problem with sleep is that due to the horrendous nightmares and flashbacks I get I don’t want to go to sleep so th…", "@starttotalkuk @2_fleurdelis I hope Denise can too. Different things works for different people. Suppose the main thing is having understanding on the subject. Therapy for me was the key, but not many people have access to Therapy #csaqt", "RT @StevenJPayton: @smile4wales I think sound, music, nature sounds does something to our minds.\nI find it much easer to relax / sleep if t…", "@StevenJPayton #CSAQT It,s like there's a switch in my brain that Ij ust can't turn off. Once in awhile I will tell myself that I can resolve source of anxiety in my dreams and once in awhile this actually works &amp; I have a pertinent dream.", "RT @Willow_B_Well: @LadyAnnatar @natasha367b @StevenJPayton QT = question time \nMasking in this case means suppressing symptoms or behavior…", "@Willow_B_Well I used to get that; I'd go from sleeping &amp; dreaming to being on my feet in a state of terror is a couple of seconds. Then I'd throw onmy clothes &amp; run out in the street even if it was 2 AM 'cause I suddenly felt claustrophobic. The terror would last abt 5 hours. #CSAQT", "@2_fleurdelis @smile4wales Hi denise\nwelcome to chat tonight\n#csaqt", "@StevenJPayton Me too. But inverse true for me as well, some days. Doing something novel or social on days off helps, while the routine tasks done alone at my desk get my anxious thoughts cycling some days. It is frustrating. #csaqt", "RT @Willow_B_Well: Hello #CSAQT - migraine kept me home today, so I thought I'd try and catch the chat.", "RT @StevenJPayton: Monday's 29th #CSAQT chat topic for survivors of Child Abuse\n'Every day impact on survivors of abuse'\nsuch as\nDifficulti…", "RT @StevenJPayton: @lilgrace2911 @CSAQT Make sure you look after yourself\n#csaqt", "@natasha367b It's so horrible. Doesn't happen as often now, thankfully. #CSAQT", "RT @CSAQT: Starting in a few minutes at #CSAQT https://t.co/PqmDOqgH8v", "RT @StevenJPayton: @Sh3llieeeeee @starttotalkuk What sort of things do you watch?\n#CSAQT", "@starttotalkuk Yeah, they most certainly soothe me. I live on my own, so my inner child sees them as security guards. Who look over me while I sleep 😊 #csaqt", "@smile4wales @StevenJPayton I find listening to rainfall though my headphones really helps to block out the noise when I'm feeling particularly anxious/overwhelmed! Consistent, steady noise #csaqt", "@starttotalkuk I second that!!!!!! I've gotta say, Twitter is a good place for this. I wish Twitter was around in my early days, as just being in touch with people who can relate helps big time! #csaqt", "@natasha367b Hi Natasha\nit Child Sex Abuse Question Time\nA twitter chat for survivors started by @shinybluedress \n#CSAQT", "@StevenJPayton I have had insomnia my entire life from time to time. The first memory I have of not being able to sleep was when I was still small enough to sleep in a crib. I was able to climb out of the crib and move around. I was maybe 3 or 4. #csaqt", "RT @Willow_B_Well: @lilgrace2911 @StevenJPayton @CSAQT Self-care is important, hope things ease up for you. #CSAQT", "@Willow_B_Well 2) I once rode the night busses all night. Just being in a public well lit area helped to lessen the panic slightly, or I'd go to stores that were open all night. I don't get these anymore since I got back a lot of buried memories. ##CSAQT", "RT @natasha367b: @StevenJPayton I have had insomnia my entire life from time to time. The first memory I have of not being able to sleep wa…", "RT @turtles4netty: @StevenJPayton It can be both tbh.. but mostly waking in the night and can’t get back off to sleep... my mind goes into…", "RT @StevenJPayton: Thank you all for joining us tonight, for supporting each other and the bravery you have all shown\nThose that feel OK to…", "RT @Willow_B_Well: @StevenJPayton @2_fleurdelis So very true! #CSAQT", "RT @natasha367b: @StevenJPayton What does CSAQT stand for? I am an abuse survivor in Canada. #csaqt", "The word 'axe' is sounded in relax, so if I'm noticing that, it isn't easy. \n[TW: abuse mentioned]\n\nPlus, I was abused after being sedated, so the whole idea is a paradox.\n\nI actually use Spanish terms in self-talk for calming myself because they don't trigger me. #CSAQT https://t.co/Vt2duWpTbz", "@Wolfg46611072 Have you found anything that helps?\n#csaqt", "Hi Kate. Welcome to chat\nHyper vigilance is another common problem for survivors.\n#csaqt https://t.co/dGANMDRxfJ", "@starttotalkuk Yh there is &amp; some teddies ave me feel fearful when I 1st see them. Its only afterwards (when Ive talked with my 'alters')when I understand the 'whys'. Barbie dolls are a no no, coz they trigger my #PTSD. My abuser destroyed my 1st Barbie &amp; beat me 4 accepting it as a gift #csaqt", "RT @sarah_wigington: Sorry I’m very late 😔 things a bit blurgh here at the moment. Hope everyone is doing ok. Just watching/reading tonight…", "Hello #CSAQT - migraine kept me home today, so I thought I'd try and catch the chat.", "RT @smile4wales: @StevenJPayton The positves are I know I am strong, survived and met some great people along the way💕 negatives are it bei…", "@turtles4netty Its difficult.\nIm afraid I dont have any answers either...\n#csaqt", "RT @StevenJPayton: An interesting article that might be of interest as it is on the same subject as our topic Monday\nhttps://t.co/VgwhqRfAu…", "RT @Sh3llieeeeee: @Willow_B_Well @starttotalkuk As they say, \"laughter is the best medicine\". 4 me, having a good laugh at anytime kills of…", "RT @StevenJPayton: @2_fleurdelis @turtles4netty May seem odd but sometimes just moving so i am lying the wrong way round in the bed helps.…", "Sorry I’m very late 😔 things a bit blurgh here at the moment. Hope everyone is doing ok. Just watching/reading tonight.  #CSAQT", "RT @StevenJPayton: @lilgrace2911 @CSAQT Hi Lucy Welcome to tonights chat :)\n#csaqt", "RT @Wolfg46611072: @StevenJPayton It's really only this barrier to start working .... Ever since l'm 10 never left me ....#CSAQT", "Gonna try and catch some of this but got to get ready for night shift too😕 #CSAQT", "@StevenJPayton I do take a preventive meds but still get breakthrough headaches, especially when emotionally stressed or sick with allergies. Lately, there's been a lot of both. #CSAQT", "Starting in a few minutes at #CSAQT https://t.co/PqmDOqgH8v", "RT @StevenJPayton: @2_fleurdelis @Willow_B_Well One of the problems, particularly when the abuse happened in the home, is that places most…", "RT @Sh3llieeeeee: @starttotalkuk was such a relief when I 1st got prescribed them.Jan 6th 2010 was the 1st time in my life that I was able…", "@Sh3llieeeeee @starttotalkuk What sort of things do you watch?\n#CSAQT", "RT @StevenJPayton: @smile4wales You say the thoughts are not always negative, but always there?\n#csaqt", "RT @smile4wales: @StevenJPayton Creative stuff helps and walking being in nature. Headphones help me get out of the door. #csaqt", "@starttotalkuk @Sh3llieeeeee This happens to me every damn night now. The loop. You described it well. #csaqt", "RT @2_fleurdelis: @StevenJPayton @smile4wales Hi. Sometimes I look for binaural beats on You Tube when my mind is racing too much to sleep.…", "@StevenJPayton There isn't a day I don't think about it. Not always negatively but, every day.  Going out of the house is difficult at the moment but I knew what tonights chat was about, challenged myself and went out👍 #CSAQT", "@turtles4netty Hi netty\ngood to see you :)\n#csaqt", "@StevenJPayton Creative stuff helps and walking being in nature. Headphones help me get out of the door. #csaqt", "RT @StevenJPayton: @turtles4netty Me: Im tired, time for sleep.\nMy brain: Here let me replay back to you every mistake, negative thing and…", "RT @CSAQT: Join the conversation at #CSAQT https://t.co/PqmDOqgH8v", "@Willow_B_Well This can be very draining. It puts me in a bad mood for the rest of the day. Making the next night's sleep even worse and end up having more nightmares #csaqt", "@smile4wales @StevenJPayton If I can get out in nature that does help so much. Otherwise, I rely on sound to deal with hypervigilance, too. #CSAQT", "RT @Willow_B_Well: @Sh3llieeeeee @starttotalkuk Abuse at night hits us where we need to feel safest. It's no wonder most of us have problem…", "RT @NBturtlebattle: @StevenJPayton @smile4wales hi all #csaqt", "RT @StevenJPayton: The transcript of last nights #CSAQT twitter chat for adult survivors of child abuse on the topic of 'what has helped us…", "@2_fleurdelis @turtles4netty I have no idea why it helps me though #csaqt", "RT @Willow_B_Well: @StevenJPayton Honestly, I think it actually is related to going to bed. I guess it's never stopped being scary for part…", "Right now I’m getting in a tiz cos I have to go to work night shift..  I’m tired and just generally not good with them 😢#CSAQT", "RT @Willow_B_Well: When we feel forced to mask our #trauma, our #neurodiversity, etc. it only compounds factors contributing to #CPTSD/#PTS…", "RT @StevenJPayton: Tonight's #CSAQT brought to U by the letter C Coping\n'Every day impact on survivors of abuse' \nsuch as Difficulties in s…", "RT @StevenJPayton: @LadyAnnatar @Willow_B_Well @natasha367b QT = Question Time\n#csaqt", "@starttotalkuk Very true. They can be traumatising, that much so I was scared to go to sleep. I always felt like I were taking part in a different version of Nightmare In Elm Street. #CSAQT", "@smile4wales I think that many survivors find the continual fight to operate in the world exhausting.\nOthers dont understand how much it takes out of us.\n#csaqt", "@Willow_B_Well @StevenJPayton Can relate. Trying to make bed, and bedrooms, safe welcoming places is complicated. #csaqt", "RT @melbcat1: Trying to catch up with the chat!!!  #CSAQT", "@neverendingly Hi Naomi\nWelcome to tonights chat\n#csaqt", "RT @2_fleurdelis: @StevenJPayton I have intrusive thoughts for long periods of time lately. Sometimes it seems I spend most of the day mana…", "RT @StevenJPayton: @2_fleurdelis @turtles4netty Maybe its just not having the 'normal' bed that the abuse happened in?\nSo we try to change…", "@smile4wales @StevenJPayton I find it's always in my mind too Lucy, not always at the front but there everyday #csaqt", "@2_fleurdelis @turtles4netty May seem odd but sometimes just moving so i am lying the wrong way round in the bed helps.\n#csaqt", "RT @2_fleurdelis: @StevenJPayton @turtles4netty Sometimes exerting just the smallest bit of control maybe helps remind that the abuse isn't…", "@StevenJPayton @CSAQT Thanks. I’m not really in a very good place so I’m not going to stick around. #csaqt", "RT @Willow_B_Well: @Sh3llieeeeee @starttotalkuk We watch comfort shows, too. Mostly comedy or classics anywhere near bedtime. #CSAQT", "@NotesOfKate @smile4wales I have a app on my phone that will play rain and other nature sounds. It has a timer so will turn itself off after an hour or two\nhelps me get to sleep sometimes\n#csaqt", "@StevenJPayton Honestly, I think it actually is related to going to bed. I guess it's never stopped being scary for parts of me. We're working on changing that idea in therapy, but not easy. #CSAQT", "@Sh3llieeeeee @starttotalkuk Which inner child should choose? With #OSDD there's moe than one in there!. #csaqt 😉", "@Willow_B_Well That must be very difficult, not getting enough sleep is debilitation.\nCan you get any ideas of the sort of triggers that trigger your insomnia?\n#csaqt", "RT @StevenJPayton: Please join us tonight between 8pm and 9pm UK time for this twitter chat\nUse the hashtag #CSAQT to join in or simply fol…", "RT @StevenJPayton: @Willow_B_Well That must be very difficult, not getting enough sleep is debilitation.\nCan you get any ideas of the sort…", "RT @StevenJPayton: @NBturtlebattle @smile4wales Hello and welcome :)\n#csaqt", "RT @StevenJPayton: @2_fleurdelis @turtles4netty I have no idea why it helps me though #csaqt", "@Willow_B_Well They are loathesome. #csaqt", "@natasha367b @emsurvivors @CSAQT I was going to ask about that, I haven heard of OSDD before :)\n#csaqt", "RT @2_fleurdelis: @StevenJPayton @turtles4netty I moved the bed out of the bedroom and sleep in the front room now! Helped for awhile. #csa…", "@natasha367b @starttotalkuk Please do, Natasha coz it really does help. It kinda acts a deterrent to protect you from the worse. Choose the teddy that your drawn to, even if you can't put in words why you like it. Let you inner child choose the teddy/teddies 😊. Post a pic when you've bought one #csaqt", "RT @StevenJPayton: @Willow_B_Well Can you control the headaches in an way Willow?\n#csaqt", "@Willow_B_Well Hi Willow\nWelcome to tonights chat, hope you are feeling a bit better now\n#csaqt", "Please join us tonight between 8pm and 9pm UK time for this twitter chat\nUse the hashtag #CSAQT to join in or simply follow @CSAQT to read along https://t.co/cYz7QiCVUB", "RT @natasha367b: @StevenJPayton @emsurvivors @CSAQT https://t.co/ERdrKQmCzd  I don't lose time which is part of #DID (Dissociative Identity…", "@smile4wales Hi Lucy\nWelcome to chat tonight :)\n#csaqt", "#csaqt do a daily battle w believing my whole existance is wrong. At a stage where I win it more easily every day but its still there in my interactions n pretending the fight doesnt exist", "@Willow_B_Well @starttotalkuk Sadly true. As I've said earlier, if it wasn't for my meds I'd never sleep.  And if I didn't discover that comfort watching certain shows helps with the nightmares, I reckon I'd still be fearful of going to sleep #csaqt", "@turtles4netty How does the insomnia present Netty? Is it difficulties in getting to sleep, or waking up through the night or both?\nNot being able to sleep can be a real problem, I often suffer from it and feel tired all the time.\n#csaqt", "On impact that survivors often report is difficulties in getting to sleep.\nThis is a known problem associated with PTSD and cause masive impact.\nDo you manage to sleep?\n#csaqt", "RT @StevenJPayton: @smile4wales But have you found anything that helps you switch off from it mall?\n#csaqt", "I'm fairly sure my headaches are related to my abuse history because I get them when triggered, dissociate &amp; switch. Plus I used to get them nearly every time I spoke to my family on the phone. #CSAQT https://t.co/T396XRkr5C", "Thank you all for joining us tonight, for supporting each other and the bravery you have all shown\nThose that feel OK to join in or follow the chat quietly.\nThe #csaqt community is all about you and what you make it.\nThank you for being with us", "RT @StevenJPayton: @turtles4netty @2_fleurdelis Maybe we have discovered something here :)\n#csaqt", "RT @StevenJPayton: @natasha367b @shinybluedress Everybody is welcome :)\n#csaqt", "@starttotalkuk Thank you too for your company and your reassurance. I'll surely rest better for it. And thank you to everyone else, hope you all are ok. Look forward to talking again to you all soon. 💜💜💜 #csaqt", "@LadyAnnatar @Willow_B_Well @natasha367b QT = Question Time\n#csaqt", "@StevenJPayton @turtles4netty I struggled with insomnia when I was in counselling. A few things that (sometimes) helped me were: 1) Writing everything down so I knew I could come back to it in the morning 2) Getting up and going back to bed again #csaqt", "RT @NotesOfKate: @smile4wales @StevenJPayton I find listening to rainfall though my headphones really helps to block out the noise when I'm…", "RT @natasha367b: @StevenJPayton @shinybluedress Okay, I qualify. I was not sure if it was about general child abuse or something more speci…", "RT @StevenJPayton: @Sh3llieeeeee @starttotalkuk Something I sometimes refer to as 'Tonights episode of Nightmare Alley' :)\n#csaqt", "Another common consequence of abuse, and possibly linked to the problems of getting off to sleep is the ability to relax is impaired.\nSurvivors often report always being on alert or having uncontrollable thoughts running through their mind\n#csaqt", "@turtles4netty Me: Im tired, time for sleep.\nMy brain: Here let me replay back to you every mistake, negative thing and worry that you ever had!!!\n#csaqt", "RT @smile4wales: @StevenJPayton I find it hard to switch that alertness off. It can be exhausting #CSAQT", "RT @StevenJPayton: Please join us 8pm - 9pm UK Monday 29th using the tag #CSAQT \n'Every day impact on survivors of child abuse'\nsuch as\nDif…", "@smile4wales I think sound, music, nature sounds does something to our minds.\nI find it much easer to relax / sleep if there are sounds\n#csaqt", "RT @StevenJPayton: @turtles4netty Its difficult.\nIm afraid I dont have any answers either...\n#csaqt", "@StevenJPayton Deadline so work as a last minute motivation ... So, l have become a last minute deadline writer #csaqt", "RT @natasha367b: @Willow_B_Well 2) I once rode the night busses all night. Just being in a public well lit area helped to lessen the panic…", "RT @StevenJPayton: @turtles4netty How does the insomnia present Netty? Is it difficulties in getting to sleep, or waking up through the nig…", "RT @neverendingly: #csaqt do a daily battle w believing my whole existance is wrong. At a stage where I win it more easily every day but it…", "I hate missing chat and I not be here on time but might catch the end of it. I went to see the new Avenger movie but they screwed up by giving me the wrong ticket that I got earlier. It was sold out by the time I found this out. 1/2 #csaqt", "RT @StevenJPayton: @smile4wales I think that many survivors find the continual fight to operate in the world exhausting.\nOthers dont unders…", "@melbcat1 Mine as well. Night terrors have become daily early morning events for me. Hyperarousal starts up right before bedtime, in anticipation. #csaqt", "Trying to catch up with the chat!!!  #CSAQT", "#csaqt I can swing from not trusting at all to putting all my faith in someone, or over sharing n scaring ppl.\n\nI can go from dropping everything for ppl to cutting them off like they r dead...", "@natasha367b @starttotalkuk Ah right. I have D.I.D, so I get what you mean by that question. For me, I go for the teddy that stands out, regardless if I don't know why. The teddy that makes me smile instantly and warms me inside. In time I come to realise the reason why I chose it. #csaqt", "@Wolfg46611072 welcome to tonights #csaqt chat", "RT @StevenJPayton: Another common consequence of abuse, and possibly linked to the problems of getting off to sleep is the ability to relax…", "Join in this twitterchat conversation tonight at the hashtag #csaqt https://t.co/RkyWKv8VLi", "@natasha367b @shinybluedress Everybody is welcome :)\n#csaqt", "@starttotalkuk Again, it took therapy for me to stop beating myself up. Wish I accessed therapy when I were younger, as understanding is crucial for overcoming abuse. Suppose I'm one of the lucky ones to have had Access to a therapist. It's why I say the #NHS has saved my life #csaqt", "@Sh3llieeeeee @starttotalkuk Abuse at night hits us where we need to feel safest. It's no wonder most of us have problems sleeping. #CSAQT", "RT @shinybluedress: Join in this twitterchat conversation tonight at the hashtag #csaqt https://t.co/RkyWKv8VLi", "Next Monday's 6th May #CSAQT Twitter chat for adult survivors of Child Abuse will be on the topic of Work\nHas the abuse impacted your ability to work?\nDoes your work environment cause you difficulty / trigger you?\nWhat would help make work easier for you?\nJoin us 8pm-9pm UK time https://t.co/JjqbNzzJ7p", "RT @natasha367b: @StevenJPayton @Willow_B_Well @2_fleurdelis Like BEDS!!!!! #CSAQT 🧛🏻‍♂️🛌🏼😨", "RT @StevenJPayton: @badbrainAJ @CSAQT Hi Andrew\nWelcome to #CSAQT chat.\nDoctors do seem reluctant to prescribe them. Did they have any last…", "@natasha367b @StevenJPayton I did that as well. I remember my first night in a regular bed, just before I turned three, because I had a terrible nightmare which I remember in HD to this day.  #CSAQT"]